In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.2.2'

# 1.2 Создание DataFrame и Series.

In [4]:
series = pd.Series(data=[2, 5, 3, 2.0])
series

0    2.0
1    5.0
2    3.0
3    2.0
dtype: float64

In [5]:
dict_array = {'row_1': 3,
              'row_2': 6,
              'row_3': 1,
              'row_4': 8,
              'row_5': 7,}

pd.Series(dict_array, index=['row_2', 'row_4', 'row_7'])

row_2    6.0
row_4    8.0
row_7    NaN
dtype: float64

In [6]:
pd.DataFrame({'col_1': pd.Series(dict_array),
              'col_2': pd.Series([5, 6, np.nan, 8], index=['row_3', 'row_4', 'row_5', 'row_6'])})

       col_1  col_2
row_1    3.0    NaN
row_2    6.0    NaN
row_3    1.0    5.0
row_4    8.0    6.0
row_5    7.0    NaN
row_6    NaN    8.0

In [7]:
pd.DataFrame({'col_1': pd.Series(dict_array),
              'col_2': pd.Series([5, 6, np.nan, 8], index=['row_3', 'row_4', 'row_5', 'row_6'])},
              index=['row_5', 'row_6', 'row_7'])

       col_1  col_2
row_5    7.0    NaN
row_6    NaN    8.0
row_7    NaN    NaN

In [8]:
# Создайте серию с 5 элементами. Индексы строк должны иметь значение row_1, row_2, row_3, row_4, row_5

series = pd.Series({'row_1': 2, 'row_2': 3, 'row_3': 5, 'row_4': 6, 'row_5': 7})
series

row_1    2
row_2    3
row_3    5
row_4    6
row_5    7
dtype: int64

In [9]:
series = pd.Series({f'row_{i}': i + 2 for i in range(1,6)}, name='Serser')
series

row_1    3
row_2    4
row_3    5
row_4    6
row_5    7
Name: Serser, dtype: int64

In [10]:
dict_in = {'row_1': 1, 'row_2': 2, 'row_3': 3, 'row_4': 4}
series = pd.Series(dict_in, index=['row_2', 'row_4'])
series

row_2    2
row_4    4
dtype: int64

In [11]:
dict_in = {'col_1': [1, 2, 3], 'col_2': [4, 5, 6]}
df = pd.DataFrame(dict_in)
df

   col_1  col_2
0      1      4
1      2      5
2      3      6

In [12]:
arr = np.random.randint(-5, 10, size=(3, 3))

pd.DataFrame(arr)

   0  1  2
0  8 -5  4
1  5  6  6
2 -2  6  1

In [13]:
arr = np.arange(9).reshape(3,3)
pd.DataFrame(arr)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [14]:
df = pd.DataFrame({f'row_{i}': list('123') for i in range(1, 4)}, index=[f'row_{i}' for i in range(1, 4)])
df

      row_1 row_2 row_3
row_1     1     1     1
row_2     2     2     2
row_3     3     3     3

In [15]:
df['row_1'].hasnans

False

# 1.3 Чтение и запись данных.

In [16]:
df = pd.DataFrame({'day': [2, 5, 6],
                   'month': [4, 1, 3],
                   'year': [2022, 2024, 2025]})
display(df)

df.to_csv('data\date_parse_date', sep=';', index=False)

   day  month  year
0    2      4  2022
1    5      1  2024
2    6      3  2025

In [17]:
df = pd.read_csv('data\date_parse_date', sep=';')
display(df)

df = pd.read_csv('data\date_parse_date', sep=';', parse_dates=[['year', 'month', 'day']])
display(df)

   day  month  year
0    2      4  2022
1    5      1  2024
2    6      3  2025

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\4130773262.py:4: FutureWarning: Support for nested sequences for 'parse_dates' in pd.read_csv is deprecated. Combine the desired columns with pd.to_datetime after parsing instead.
  df = pd.read_csv('data\date_parse_date', sep=';', parse_dates=[['year', 'month', 'day']])

  year_month_day
0     2022-04-02
1     2024-01-05
2     2025-03-06

# 1.5 Индексы. Доступ к данным.

In [18]:
df = pd.read_csv('data\sales.csv')
df.head()

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

In [19]:
# Установка индекса

df.set_index('date').head()

              item  price  quantity
date
2020-01-01   mouse     35         5
2020-01-02  laptop     73         4
2020-01-03   phone     90         7
2020-01-04   phone     91         9
2020-01-05   mouse     65         9

In [20]:
# Мультииндекс

df.set_index(['date', 'price']).head()

                    item  quantity
date       price
2020-01-01 35      mouse         5
2020-01-02 73     laptop         4
2020-01-03 90      phone         7
2020-01-04 91      phone         9
2020-01-05 65      mouse         9

In [21]:
# Добавление к существующему индексу

df.set_index('date',
             append=True).head()

                item  price  quantity
  date
0 2020-01-01   mouse     35         5
1 2020-01-02  laptop     73         4
2 2020-01-03   phone     90         7
3 2020-01-04   phone     91         9
4 2020-01-05   mouse     65         9

In [22]:
# Сброс индекса

df_new = df.set_index(['date', 'price'])
display(df_new.head())

df_new.reset_index(['date'], inplace=True)
display(df_new.head())

                    item  quantity
date       price
2020-01-01 35      mouse         5
2020-01-02 73     laptop         4
2020-01-03 90      phone         7
2020-01-04 91      phone         9
2020-01-05 65      mouse         9

             date    item  quantity
price
35     2020-01-01   mouse         5
73     2020-01-02  laptop         4
90     2020-01-03   phone         7
91     2020-01-04   phone         9
65     2020-01-05   mouse         9

In [23]:
# Возвращаются строки со значением True
df_new = df.loc[:5, :]
display(df_new)

display(df_new[[False, True, False, False, False, True]])

# Изменение выбранных строк

df_new.loc[[True, False, False, False, False, True]] = 100
display(df_new)

         date    item  price  quantity
0  2020-01-01   mouse     35         5
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9
5  2020-01-06    book     23         4

         date    item  price  quantity
1  2020-01-02  laptop     73         4
5  2020-01-06    book     23         4

         date    item  price  quantity
0         100     100    100       100
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9
5         100     100    100       100

In [24]:
df_new[[False, True, False, False, False, True]][['date']]

         date
1  2020-01-02
5         100

In [25]:
# Добавление столбцов

display(df_new.head())

df_new = df_new.assign(new_item=df_new['item'], new_price=df_new['price'])
display(df_new.head())

         date    item  price  quantity
0         100     100    100       100
1  2020-01-02  laptop     73         4
2  2020-01-03   phone     90         7
3  2020-01-04   phone     91         9
4  2020-01-05   mouse     65         9

         date    item  price  quantity new_item  new_price
0         100     100    100       100      100        100
1  2020-01-02  laptop     73         4   laptop         73
2  2020-01-03   phone     90         7    phone         90
3  2020-01-04   phone     91         9    phone         91
4  2020-01-05   mouse     65         9    mouse         65

# 1.6 Мультииндекс.

In [26]:
# Первый способ. Из списка

array = [[1, 1, 2, 2],
         ['row_1', 'row_2', 'row_3', 'row_4']]
multi_array = pd.MultiIndex.from_arrays(array, names=['level_0', 'level_1'])
multi_array

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (2, 'row_3'),
            (2, 'row_4')],
           names=['level_0', 'level_1'])

In [27]:
data = np.random.randint(1, 5, size=[4, 4])
df = pd.DataFrame(data, index=multi_array)
df

                 0  1  2  3
level_0 level_1
1       row_1    2  1  2  2
        row_2    4  3  4  2
2       row_3    3  3  4  4
        row_4    4  4  4  4

In [28]:
df = pd.DataFrame(data, columns=multi_array)
df

level_0     1           2
level_1 row_1 row_2 row_3 row_4
0           2     1     2     2
1           4     3     4     2
2           3     3     4     4
3           4     4     4     4

In [29]:
# Второй способ. Из product

level_0 = ['row_1', 'row_2']
level_1 = [1, 2, 3]

multi_product = pd.MultiIndex.from_product([level_0, level_1], names=['level_0', 'level_1'])
multi_product

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])

In [30]:
data = np.random.randint(1, 5, size=[6, 4])
df = pd.DataFrame(data, index=multi_product)
df

                 0  1  2  3
level_0 level_1
row_1   1        2  2  3  2
        2        2  4  4  4
        3        3  1  1  3
row_2   1        3  4  3  4
        2        3  1  1  1
        3        1  4  1  1

In [31]:
# Второй способ. Из списка кортежей

tuples = [(1, 'row_1'), (1, 'row_2'), (1, 'row_3'), (2, 'row_1'), (2, 'row_2'), (2, 'row_3')]

multi_tuples = pd.MultiIndex.from_tuples(tuples=tuples, names=['level_0', 'level_1'])
multi_tuples

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (1, 'row_3'),
            (2, 'row_1'),
            (2, 'row_2'),
            (2, 'row_3')],
           names=['level_0', 'level_1'])

In [32]:
data = np.random.randint(1, 5, size=[6, 4])
df = pd.DataFrame(data, index=multi_tuples)
df

                 0  1  2  3
level_0 level_1
1       row_1    2  1  1  4
        row_2    4  1  2  3
        row_3    1  3  4  2
2       row_1    4  3  3  3
        row_2    2  2  4  3
        row_3    2  1  4  1

In [33]:
# Получение мультииндекса

df.index

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (1, 'row_3'),
            (2, 'row_1'),
            (2, 'row_2'),
            (2, 'row_3')],
           names=['level_0', 'level_1'])

In [34]:
# Число уровней

df.index.nlevels

2

In [35]:
# Кортеж с длинной каждого уровня

df.index.levshape

(2, 3)

In [36]:
# Имена уровней

df.index.names

FrozenList(['level_0', 'level_1'])

In [37]:
# Изменение имен

df.index.names = ['new_level_0', 'new_level_1']
df.index.names

FrozenList(['new_level_0', 'new_level_1'])

In [38]:
# Объект, содержащий элементы мультииндекса

df.index.levels

FrozenList([[1, 2], ['row_1', 'row_2', 'row_3']])

In [39]:
df.index.set_names('level_0', level=0, inplace=True)
df.index.names

FrozenList(['level_0', 'new_level_1'])

In [40]:
df.index = multi_product
df.index

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])

In [41]:
# Изменение значений уровней мультииндекса

new_index = df.index.set_levels([[4, 5, 6], ['q', 'w', 'e', 'r', 't', 'y']])
new_index

MultiIndex([(4, 'q'),
            (4, 'w'),
            (4, 'e'),
            (5, 'q'),
            (5, 'w'),
            (5, 'e')],
           names=['level_0', 'level_1'])

In [42]:
new_index = df.index.set_levels( ['a', 'b', 'c', 'd', 'e'], level=1)
new_index

MultiIndex([('row_1', 'a'),
            ('row_1', 'b'),
            ('row_1', 'c'),
            ('row_2', 'a'),
            ('row_2', 'b'),
            ('row_2', 'c')],
           names=['level_0', 'level_1'])

In [43]:
# Сброс уровней мультииндекса

df_new = df.reset_index()

df_new

  level_0  level_1  0  1  2  3
0   row_1        1  2  1  1  4
1   row_1        2  4  1  2  3
2   row_1        3  1  3  4  2
3   row_2        1  4  3  3  3
4   row_2        2  2  2  4  3
5   row_2        3  2  1  4  1

In [44]:
df_new = df.copy()
df_new.reset_index(['level_0'], inplace=True)
df_new

        level_0  0  1  2  3
level_1
1         row_1  2  1  1  4
2         row_1  4  1  2  3
3         row_1  1  3  4  2
1         row_2  4  3  3  3
2         row_2  2  2  4  3
3         row_2  2  1  4  1

In [45]:
# Удаление мультииндекса

print(df.index)

new_index = df.index.droplevel()
print(new_index)

new_index = df.index.droplevel(level=1)
print(new_index)

new_index = df.index.droplevel(['level_0'])
print(new_index)

MultiIndex([('row_1', 1),
            ('row_1', 2),
            ('row_1', 3),
            ('row_2', 1),
            ('row_2', 2),
            ('row_2', 3)],
           names=['level_0', 'level_1'])
Index([1, 2, 3, 1, 2, 3], dtype='int64', name='level_1')
Index(['row_1', 'row_1', 'row_1', 'row_2', 'row_2', 'row_2'], dtype='object', name='level_0')
Index([1, 2, 3, 1, 2, 3], dtype='int64', name='level_1')

In [46]:
# Первый способ. Из списка

array = [[1, 1, 2, 2],
         ['row_1', 'row_2', 'row_3', 'row_4']]
multi_array = pd.MultiIndex.from_arrays(array, names=['level_0', 'level_1'])
multi_array

MultiIndex([(1, 'row_1'),
            (1, 'row_2'),
            (2, 'row_3'),
            (2, 'row_4')],
           names=['level_0', 'level_1'])

In [47]:
data = np.random.randint(1, 5, size=[4, 4])
df = pd.DataFrame(data, columns=multi_array)
df

level_0     1           2
level_1 row_1 row_2 row_3 row_4
0           2     1     2     3
1           3     1     3     4
2           1     2     1     3
3           1     3     2     3

In [48]:
df.columns.levels

FrozenList([[1, 2], ['row_1', 'row_2', 'row_3', 'row_4']])

In [49]:
df.columns = ['asd_1', 'asd_2', 'asd_3', 'asd_4']
df

   asd_1  asd_2  asd_3  asd_4
0      2      1      2      3
1      3      1      3      4
2      1      2      1      3
3      1      3      2      3

# 1.7 Арифметические операции.

In [50]:
data = {
    'год рождения' : [88, 89, 90, 91, 92,],
    'стаж работы' : [3.25, 4.50, 5.75, 6.25, 7.50,],
    'зарплата' : [60, 70, 80, 90, 100,],
}

df = pd.DataFrame(data)
display(df)

df['год рождения'] = '19' + df['год рождения'].astype(str) 
df['стаж работы'] = df['стаж работы'].mul(12)
df['зарплата'] = df['зарплата'].mul(1000)
display(df)

   год рождения  стаж работы  зарплата
0            88         3.25        60
1            89         4.50        70
2            90         5.75        80
3            91         6.25        90
4            92         7.50       100

  год рождения  стаж работы  зарплата
0         1988         39.0     60000
1         1989         54.0     70000
2         1990         69.0     80000
3         1991         75.0     90000
4         1992         90.0    100000

In [51]:
new_df = pd.DataFrame()

new_df['год рождения'] = '19' + df['год рождения'].astype(str) 
new_df['стаж работы'] = df['стаж работы'].mul(12)
new_df['зарплата'] = df['зарплата'].mul(1000)

new_df

  год рождения  стаж работы   зарплата
0       191988        468.0   60000000
1       191989        648.0   70000000
2       191990        828.0   80000000
3       191991        900.0   90000000
4       191992       1080.0  100000000

In [52]:
df = pd.DataFrame({'age': range(19, 23),
                   'exp': range(3, 7),
                   'pr': np.arange(6, 10) * 1000})
df

   age  exp    pr
0   19    3  6000
1   20    4  7000
2   21    5  8000
3   22    6  9000

In [53]:
ser = pd.Series({'exp_mean': 22.2,
                 'age_mean': 5.0,
                 'pr_mean': 80000.0})
ser

exp_mean       22.2
age_mean        5.0
pr_mean     80000.0
dtype: float64

In [54]:
new_df = df.sub([ser.iloc[1], ser.iloc[0], ser.iloc[2]])
new_df

    age   exp       pr
0  14.0 -19.2 -74000.0
1  15.0 -18.2 -73000.0
2  16.0 -17.2 -72000.0
3  17.0 -16.2 -71000.0

In [55]:
new_df = df[['exp', 'age', 'pr']].sub(ser.to_list())
new_df

    exp   age       pr
0 -19.2  14.0 -74000.0
1 -18.2  15.0 -73000.0
2 -17.2  16.0 -72000.0
3 -16.2  17.0 -71000.0

# 1.8 Операции сравнения.

In [56]:
np.nan == np.nan

False

In [57]:
np.nan < 100

False

In [58]:
ser = pd.Series([1, 2, 3, 4, 5])
ser

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [59]:
df = pd.DataFrame({'col_1': [5, 6, np.nan, 3, 7],
                   'col_2': [27, 6, 7, 40, 70],
                   'col_3': [1, 45, 6, 62, 7]},
                   index=['row_1', 'row_2', 'row_3', 'row_4', 'row_5'])
df

       col_1  col_2  col_3
row_1    5.0     27      1
row_2    6.0      6     45
row_3    NaN      7      6
row_4    3.0     40     62
row_5    7.0     70      7

In [60]:
df_copy = df.copy() - 1
df_copy

       col_1  col_2  col_3
row_1    4.0     26      0
row_2    5.0      5     44
row_3    NaN      6      5
row_4    2.0     39     61
row_5    6.0     69      6

In [61]:
ser == [1, 3, 5, 4, 5]

0     True
1    False
2    False
3     True
4     True
dtype: bool

In [62]:
df['col_1'] == df['col_2']

row_1    False
row_2     True
row_3    False
row_4    False
row_5    False
dtype: bool

In [63]:
# Сравнение по столбцам (3 столбца)

df == [7, 6, 5]

       col_1  col_2  col_3
row_1  False  False  False
row_2  False   True  False
row_3  False  False  False
row_4  False  False  False
row_5   True  False  False

In [64]:
# Количество строк, столбцов и их имена должны совпадать

df > df_copy

       col_1  col_2  col_3
row_1   True   True   True
row_2   True   True   True
row_3  False   True   True
row_4   True   True   True
row_5   True   True   True

In [65]:
# Возможно сравнение серий и дф с неодинаковыми индексами
# Сначала происходит выравнивание индексов
# Возможно сравнение по строкам и столбцам (axis=0, axis=1)

# eq() - ==
# ne() - !=
# le() - <=
# lt() - <
# ge() - >=
# gt() - >

In [66]:
df.eq(ser, axis=0)

       col_1  col_2  col_3
row_1  False  False  False
row_2  False  False  False
row_3  False  False  False
row_4  False  False  False
row_5  False  False  False
0      False  False  False
1      False  False  False
2      False  False  False
3      False  False  False
4      False  False  False

In [67]:
df.eq(ser, axis=1)

       col_1  col_2  col_3      0      1      2      3      4
row_1  False  False  False  False  False  False  False  False
row_2  False  False  False  False  False  False  False  False
row_3  False  False  False  False  False  False  False  False
row_4  False  False  False  False  False  False  False  False
row_5  False  False  False  False  False  False  False  False

In [68]:
# df < df[['col_3', 'col_2', 'col_1']] - ошибка

df.eq(df[['col_3', 'col_2', 'col_1']]) # - выравнивание индексов

       col_1  col_2  col_3
row_1   True   True   True
row_2   True   True   True
row_3  False   True   True
row_4   True   True   True
row_5   True   True   True

In [69]:
# Метод equals

print(df.equals(df_new))
print(df.equals(df))
print(df.equals(df[['col_3', 'col_2', 'col_1']]))

False
True
False

In [70]:
df_2 = pd.DataFrame({'col_1': [5, 6, np.nan, 3],
                   'col_2': [27, 6, 7, 40]},
                   index=['row_1', 'row_2', 'row_3', 'row_4'])
df_2

       col_1  col_2
row_1    5.0     27
row_2    6.0      6
row_3    NaN      7
row_4    3.0     40

In [71]:
print(df.equals(df_2))
print(df_2.equals(ser))

False
False

In [72]:
ser = pd.Series([5, 22.2, 8000], ['exp_mean', 'age_mean', 'pr_mean'])
ser

exp_mean       5.0
age_mean      22.2
pr_mean     8000.0
dtype: float64

In [73]:
df = pd.DataFrame({'age': [22, 55, 33, 21],
                   'exp': [3, 2, 5, 7],
                   'pr': [1000, 200000, 33333, 100000]})
df

   age  exp      pr
0   22    3    1000
1   55    2  200000
2   33    5   33333
3   21    7  100000

In [74]:
df > ser.loc[['age_mean', 'exp_mean', 'pr_mean']].to_list()

     age    exp     pr
0  False  False  False
1   True  False   True
2   True  False   True
3  False   True   True

In [75]:
df > ser.iloc[[1, 0, 2]].to_list()

     age    exp     pr
0  False  False  False
1   True  False   True
2   True  False   True
3  False   True   True

# Методы all() и any().

In [76]:
df = pd.DataFrame({'col_1': [True, False, True],
                   'col_2': [False, False, False],
                   'col_3': [True, True, True]})
df

   col_1  col_2  col_3
0   True  False   True
1  False  False   True
2   True  False   True

In [77]:
df.all()

col_1    False
col_2    False
col_3     True
dtype: bool

In [78]:
df.any()

col_1     True
col_2    False
col_3     True
dtype: bool

In [79]:
# True - если всек элементы True
df.all(axis=None)

False

In [80]:
# True - если хотя бы один элемент True
df.any(axis=None)

True

In [81]:
df['col_1'].any()

True

In [82]:
df['col_3'].all()

True

In [83]:
dict_array = {'age': [53, 37, 11, 18, 7],
              'name': ['Сергей', 'Маша', 'Ксюша', 'Аристарх', 'Соня'],
              'наличие авто': [True, True, False, True, False]}

df = pd.DataFrame(dict_array)
df

   age      name  наличие авто
0   53    Сергей          True
1   37      Маша          True
2   11     Ксюша         False
3   18  Аристарх          True
4    7      Соня         False

In [84]:
# Фильтрация по bool

df[[True, False, False, False, True]]

   age    name  наличие авто
0   53  Сергей          True
4    7    Соня         False

In [85]:
age_var = 4

In [86]:
df.query('not `наличие авто` and age < 3 * @age_var')

   age   name  наличие авто
2   11  Ксюша         False
4    7   Соня         False

In [87]:
df

   age      name  наличие авто
0   53    Сергей          True
1   37      Маша          True
2   11     Ксюша         False
3   18  Аристарх          True
4    7      Соня         False

In [88]:
df_test = df[['age']]
df_test

   age
0   53
1   37
2   11
3   18
4    7

In [89]:
df_test[df_test['age'] < 30].index.to_list()

[2, 3, 4]

In [90]:
df['марка авто'] = ['BMW', 'BMW', 'Opel', np.nan, np.nan]

# 1.10 Пропуски в данных. Значение Nan.

In [91]:
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [92]:
# Удаление строк и столбцов с пропусками

# df.dropna(axis=0)
# df.dropna(axis=1)

In [93]:
# df.dropna(how='all')
# df.dropna(how='any')

In [94]:
# df.dropna(subset=['age', 'name])

In [95]:
# # Замена пропусков значением

# df.fillna(value='var')

# df.fillna(value={'age': 20, 'name': 'Юля', 'наличие авто': True})

In [96]:
df[df['марка авто'].isna()]

   age      name  наличие авто марка авто
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [97]:
df[ ~ df['марка авто'].isna()]

   age    name  наличие авто марка авто
0   53  Сергей          True        BMW
1   37    Маша          True        BMW
2   11   Ксюша         False       Opel

In [98]:
df[df['марка авто'].notna()]

   age    name  наличие авто марка авто
0   53  Сергей          True        BMW
1   37    Маша          True        BMW
2   11   Ксюша         False       Opel

In [99]:
df.fillna({'марка авто': 'asd'})

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        asd
4    7      Соня         False        asd

In [100]:
df.isna()

     age   name  наличие авто  марка авто
0  False  False         False       False
1  False  False         False       False
2  False  False         False       False
3  False  False         False        True
4  False  False         False        True

In [101]:
df.dropna()

   age    name  наличие авто марка авто
0   53  Сергей          True        BMW
1   37    Маша          True        BMW
2   11   Ксюша         False       Opel

In [102]:
stud_list = df[~df.isna().any(axis=1)].index.to_list()
stud_list

[0, 1, 2]

# 1.11 Удаление строк и столбцов

In [103]:
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [104]:
df.drop([1, 3], axis=0)

   age    name  наличие авто марка авто
0   53  Сергей          True        BMW
2   11   Ксюша         False       Opel
4    7    Соня         False        NaN

In [105]:
df.drop(['age', 'name'], axis=1)

   наличие авто марка авто
0          True        BMW
1          True        BMW
2         False       Opel
3          True        NaN
4         False        NaN

In [106]:
df.drop(index=2, columns='name')

   age  наличие авто марка авто
0   53          True        BMW
1   37          True        BMW
3   18          True        NaN
4    7         False        NaN

# 1.11 Метод astype().

In [107]:
df.dtypes

age              int64
name            object
наличие авто      bool
марка авто      object
dtype: object

In [108]:
df.memory_usage()

Index           132
age              40
name             40
наличие авто      5
марка авто       40
dtype: int64

In [109]:
df['age'] = df['age'].astype('int8')
df.memory_usage()

Index           132
age               5
name             40
наличие авто      5
марка авто       40
dtype: int64

In [110]:
df = df.astype({'age': 'int16',
                'марка авто': 'category'})
display(df)
df.memory_usage()

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

Index           132
age              10
name             40
наличие авто      5
марка авто      129
dtype: int64

# 2.1 Методы at и iat. Методы loс и iloc.

In [111]:
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [112]:
# Обращение к одному элементу

df.at[0, 'name']

'Сергей'

In [113]:
df.iat[2, 3]

'Opel'

In [114]:
df['age'].iat[2]

11

In [115]:
df.loc[:, ['age', 'name']] = df[['name', 'age']]
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [116]:
new_ser = df.iloc[2:5, 1]
new_ser

2       Ксюша
3    Аристарх
4        Соня
Name: name, dtype: object

In [117]:
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [118]:
df.loc[df['age'] > 15, ['name', 'наличие авто']]
df.loc[df['age'] > 15][['name', 'наличие авто']]

       name  наличие авто
0    Сергей          True
1      Маша          True
3  Аристарх          True

In [119]:
df

   age      name  наличие авто марка авто
0   53    Сергей          True        BMW
1   37      Маша          True        BMW
2   11     Ксюша         False       Opel
3   18  Аристарх          True        NaN
4    7      Соня         False        NaN

In [120]:
df[~df.isna().any(axis=1)]['name']

0    Сергей
1      Маша
2     Ксюша
Name: name, dtype: object

In [121]:
df.loc[df['марка авто'].notna(), 'name']

0    Сергей
1      Маша
2     Ксюша
Name: name, dtype: object

# 2.2 Методы value_counts(), sort_values(), unique(), nunique()

In [122]:
df = pd.concat([df, pd.DataFrame({'age': ['15'], 'name': ['Аристарх'], 'наличие авто': [False], 'марка авто': ['asd']}, index=[5]),
               pd.DataFrame({'age': ['18'], 'name': ['Аристарх'], 'наличие авто': [True], 'марка авто': ['asd']}, index=[6]),
               pd.DataFrame({'age': ['18'], 'name': ['Аристарх'], 'наличие авто': [True], 'марка авто': ['asd']}, index=[7])])
df

  age      name  наличие авто марка авто
0  53    Сергей          True        BMW
1  37      Маша          True        BMW
2  11     Ксюша         False       Opel
3  18  Аристарх          True        NaN
4   7      Соня         False        NaN
5  15  Аристарх         False        asd
6  18  Аристарх          True        asd
7  18  Аристарх          True        asd

In [123]:
ser = pd.Series(['Сергей', 'Соня', 'Сергей', 'Аристарх', 'Соня'], name='name')
ser

0      Сергей
1        Соня
2      Сергей
3    Аристарх
4        Соня
Name: name, dtype: object

In [124]:
df[df['name'].isin(ser.unique())]['name'].value_counts()

name
Аристарх    4
Сергей      1
Соня        1
Name: count, dtype: int64

In [125]:
df.value_counts(['age', 'name'])

age  name
18   Аристарх    2
7    Соня        1
11   Ксюша       1
18   Аристарх    1
37   Маша        1
53   Сергей      1
15   Аристарх    1
Name: count, dtype: int64

In [126]:
df.value_counts(['age', 'name'], dropna=False)

age  name
18   Аристарх    2
7    Соня        1
11   Ксюша       1
18   Аристарх    1
37   Маша        1
53   Сергей      1
15   Аристарх    1
Name: count, dtype: int64

In [127]:
# Пропорция

df.value_counts('name', normalize=True)

name
Аристарх    0.500
Ксюша       0.125
Маша        0.125
Сергей      0.125
Соня        0.125
Name: proportion, dtype: float64

In [128]:
df.sort_values('марка авто', na_position='first')

  age      name  наличие авто марка авто
3  18  Аристарх          True        NaN
4   7      Соня         False        NaN
0  53    Сергей          True        BMW
1  37      Маша          True        BMW
2  11     Ксюша         False       Opel
5  15  Аристарх         False        asd
6  18  Аристарх          True        asd
7  18  Аристарх          True        asd

# Метод map()

In [129]:
# Метод map(arg, na_action=None):

# Данный метод используется для замены каждого значения в Series или Index другим значением, которое может быть получено из функции, словаря или Series. 
# На вход принимает два аргумента arg и na_action. Аргумент arg может быть или серией, или словарем, или функцией. Аргумент na_action по умолчанию None, 
# если принимает значение 'ignore', то значения Nan не будут преобразовываться.

In [130]:
# Пример 1

arg_dict = {'товар_0': 'product_0', 'товар_1': 'product_1', 'товар_2': 'product_2', 'товар_3': 'product_3', 'товар_4': 'product_4'}
arg_dict

{'товар_0': 'product_0',
 'товар_1': 'product_1',
 'товар_2': 'product_2',
 'товар_3': 'product_3',
 'товар_4': 'product_4'}

In [131]:
ser_test = pd.Series(f'товар_{i}' for i in range(6))
ser_test

0    товар_0
1    товар_1
2    товар_2
3    товар_3
4    товар_4
5    товар_5
dtype: object

In [132]:
ser_test.map(arg_dict)

0    product_0
1    product_1
2    product_2
3    product_3
4    product_4
5          NaN
dtype: object

In [133]:
# Пример 2

ser_test

0    товар_0
1    товар_1
2    товар_2
3    товар_3
4    товар_4
5    товар_5
dtype: object

In [134]:
def func(str_in):
    return str_in.replace('товар', 'product')

In [135]:
ser_test.map(func)

0    product_0
1    product_1
2    product_2
3    product_3
4    product_4
5    product_5
dtype: object

In [136]:
# Пример 4

ser_test.map(lambda x: x.replace('товар','product'))

0    product_0
1    product_1
2    product_2
3    product_3
4    product_4
5    product_5
dtype: object

In [137]:
# Пример 5

ser_test[6] = np.NaN
ser_test

0    товар_0
1    товар_1
2    товар_2
3    товар_3
4    товар_4
5    товар_5
6        NaN
dtype: object

In [138]:
# na_action='ignore' - к пропускам не применяются преобразования

ser_test.map(type, na_action='ignore')

0    <class 'str'>
1    <class 'str'>
2    <class 'str'>
3    <class 'str'>
4    <class 'str'>
5    <class 'str'>
6              NaN
dtype: object

In [139]:
# Задача
# Заменить 1.0 на True, остальное - на False

category_list = ['Имя_0','Имя_1','Имя_2','Имя_3','Имя_4','Имя_5','Имя_6','Имя_7','Имя_8','Имя_9']
Post = [1.0, 0.0]
Post1 = [1.0, 0.0, np.nan]

df=pd.DataFrame({
                 'name':[category_list[i%9] for i in range(9)],
                 '1': [Post[i%2] for i in range(9)],
                 '2': [Post[i%2] for i in range(9)],
                 '3': [Post[i%2] for i in range(9)],
                 '4': [Post1[i%3] for i in range(9)],
                 '5': [Post[i%2] for i in range(9)],
                 '6': [Post1[i%3] for i in range(9)],
                 '7': [Post[i%2] for i in range(9)],
                 '8': [Post[i%2] for i in range(9)],
                 '9': [Post[i%2] for i in range(9)]},
                 index=[ f'row_{i}' for i in range (9) ])
df

        name    1    2    3    4    5    6    7    8    9
row_0  Имя_0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
row_1  Имя_1  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
row_2  Имя_2  1.0  1.0  1.0  NaN  1.0  NaN  1.0  1.0  1.0
row_3  Имя_3  0.0  0.0  0.0  1.0  0.0  1.0  0.0  0.0  0.0
row_4  Имя_4  1.0  1.0  1.0  0.0  1.0  0.0  1.0  1.0  1.0
row_5  Имя_5  0.0  0.0  0.0  NaN  0.0  NaN  0.0  0.0  0.0
row_6  Имя_6  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
row_7  Имя_7  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
row_8  Имя_8  1.0  1.0  1.0  NaN  1.0  NaN  1.0  1.0  1.0

In [140]:
new_df = pd.concat([df['name'], df.iloc[:, 1:].isin([1])], axis=1)
new_df

        name      1      2      3      4      5      6      7      8      9
row_0  Имя_0   True   True   True   True   True   True   True   True   True
row_1  Имя_1  False  False  False  False  False  False  False  False  False
row_2  Имя_2   True   True   True  False   True  False   True   True   True
row_3  Имя_3  False  False  False   True  False   True  False  False  False
row_4  Имя_4   True   True   True  False   True  False   True   True   True
row_5  Имя_5  False  False  False  False  False  False  False  False  False
row_6  Имя_6   True   True   True   True   True   True   True   True   True
row_7  Имя_7  False  False  False  False  False  False  False  False  False
row_8  Имя_8   True   True   True  False   True  False   True   True   True

In [141]:
new_df = df.replace([1.0, 0.0, np.nan], [True, False, False])
new_df

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\2102203626.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_df = df.replace([1.0, 0.0, np.nan], [True, False, False])

        name      1      2      3      4      5      6      7      8      9
row_0  Имя_0   True   True   True   True   True   True   True   True   True
row_1  Имя_1  False  False  False  False  False  False  False  False  False
row_2  Имя_2   True   True   True  False   True  False   True   True   True
row_3  Имя_3  False  False  False   True  False   True  False  False  False
row_4  Имя_4   True   True   True  False   True  False   True   True   True
row_5  Имя_5  False  False  False  False  False  False  False  False  False
row_6  Имя_6   True   True   True   True   True   True   True   True   True
row_7  Имя_7  False  False  False  False  False  False  False  False  False
row_8  Имя_8   True   True   True  False   True  False   True   True   True

In [142]:
new_df = df.set_index('name').isin([1])
new_df = new_df.reset_index('name')
new_df

    name      1      2      3      4      5      6      7      8      9
0  Имя_0   True   True   True   True   True   True   True   True   True
1  Имя_1  False  False  False  False  False  False  False  False  False
2  Имя_2   True   True   True  False   True  False   True   True   True
3  Имя_3  False  False  False   True  False   True  False  False  False
4  Имя_4   True   True   True  False   True  False   True   True   True
5  Имя_5  False  False  False  False  False  False  False  False  False
6  Имя_6   True   True   True   True   True   True   True   True   True
7  Имя_7  False  False  False  False  False  False  False  False  False
8  Имя_8   True   True   True  False   True  False   True   True   True

In [143]:
new_df = df.isin([0, np.nan])
new_df

        name      1      2      3      4      5      6      7      8      9
row_0  False  False  False  False  False  False  False  False  False  False
row_1  False   True   True   True   True   True   True   True   True   True
row_2  False  False  False  False   True  False   True  False  False  False
row_3  False   True   True   True  False   True  False   True   True   True
row_4  False  False  False  False   True  False   True  False  False  False
row_5  False   True   True   True   True   True   True   True   True   True
row_6  False  False  False  False  False  False  False  False  False  False
row_7  False   True   True   True   True   True   True   True   True   True
row_8  False  False  False  False   True  False   True  False  False  False

In [144]:
new_df = df.iloc[:, :].map(lambda x: x == 0 or pd.isna(x))
new_df

        name      1      2      3      4      5      6      7      8      9
row_0  False  False  False  False  False  False  False  False  False  False
row_1  False   True   True   True   True   True   True   True   True   True
row_2  False  False  False  False   True  False   True  False  False  False
row_3  False   True   True   True  False   True  False   True   True   True
row_4  False  False  False  False   True  False   True  False  False  False
row_5  False   True   True   True   True   True   True   True   True   True
row_6  False  False  False  False  False  False  False  False  False  False
row_7  False   True   True   True   True   True   True   True   True   True
row_8  False  False  False  False   True  False   True  False  False  False

# 2.4 Агрегация данных. Методы agg().

In [145]:
dict_in = {'col_1': [1, 2, 3], 'col_2': [4, 5, 6]}
df = pd.DataFrame(dict_in)
df

   col_1  col_2
0      1      4
1      2      5
2      3      6

In [146]:
df.agg([np.sum], axis=1)

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\418043873.py:1: FutureWarning: The provided callable <function sum at 0x0000021D07DBBC40> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.agg([np.sum], axis=1)

   sum
0    5
1    7
2    9

In [147]:
df.agg({'col_1': [np.sum, np.mean],
                'col_2': np.mean})

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\1474916148.py:1: FutureWarning: The provided callable <function sum at 0x0000021D07DBBC40> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.agg({'col_1': [np.sum, np.mean],
C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\1474916148.py:1: FutureWarning: The provided callable <function mean at 0x0000021D07DDCD60> is currently using Series.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  df.agg({'col_1': [np.sum, np.mean],

      col_1  col_2
sum     6.0    NaN
mean    2.0    5.0

In [148]:
df['col_1'].agg([np.min, np.max, np.sum])

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3342897819.py:1: FutureWarning: The provided callable <function min at 0x0000021D07DDC4A0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df['col_1'].agg([np.min, np.max, np.sum])
C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3342897819.py:1: FutureWarning: The provided callable <function max at 0x0000021D07DDC360> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df['col_1'].agg([np.min, np.max, np.sum])
C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3342897819.py:1: FutureWarning: The provided callable <function sum at 0x0000021D07DBBC40> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df['col_1'].agg([np.min, np.max, np.sum])

min    1
max    3
sum    6
Name: col_1, dtype: int64

In [149]:
df = pd.read_csv('data\stud.csv')
df.head()

,name,1,2,3,4,5,6,7,8,9,...,41,42,43,44,45,46,47,48,49,50
0,Имя_0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,0.0,1.0,1.0,0.0,1.0,1.0,1.0,1.0,1.0,1.0
1,Имя_1,1.0,1.0,1.0,1.0,1.0,0.0,1.0,1.0,1.0,...,1.0,1.0,0.0,1.0,1.0,1.0,1.0,1.0,1.0,0.0
2,Имя_2,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,0.0,1.0,1.0,1.0,1.0,0.0,1.0,1.0,1.0
3,Имя_3,1.0,1.0,1.0,0.0,0.0,1.0,1.0,1.0,1.0,...,1.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,1.0,1.0
4,Имя_4,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,0.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,0.0

In [150]:
df.shape

(50, 51)

In [151]:
# Количество решенных задач (1.0)

new_ser = df.set_index('name').agg(np.sum, axis=1)
new_ser.head()

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3980144481.py:3: FutureWarning: The provided callable <function sum at 0x0000021D07DBBC40> is currently using DataFrame.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  new_ser = df.set_index('name').agg(np.sum, axis=1)

name
Имя_0    43.0
Имя_1    40.0
Имя_2    39.0
Имя_3    39.0
Имя_4    42.0
dtype: float64

In [152]:
# Количество нерешенных задач (0.0)

new_ser = df.set_index('name').map(lambda x: 1 if x == 0.0 else 0).sum(axis=1).head()
new_ser.head()

name
Имя_0     6
Имя_1    10
Имя_2    10
Имя_3    10
Имя_4     8
dtype: int64

In [153]:
new_ser = df.set_index('name').map(lambda x: 1 if x == 0.0 else 0).sum(axis=1).head()
new_ser.head()

name
Имя_0     6
Имя_1    10
Имя_2    10
Имя_3    10
Имя_4     8
dtype: int64

In [154]:
new_ser = df.set_index('name').eq(0).sum(axis=1)
new_ser.head()

name
Имя_0     6
Имя_1    10
Имя_2    10
Имя_3    10
Имя_4     8
dtype: int64

In [155]:
new_ser = (df.set_index('name') == 0).sum(axis = 1)
new_ser.head()

name
Имя_0     6
Имя_1    10
Имя_2    10
Имя_3    10
Имя_4     8
dtype: int64

In [156]:
(df.set_index('name') == 0).head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
name,,,,,,,,,,,,,,,,,,,,,
Имя_0,False,False,False,False,False,False,False,False,False,False,...,True,False,False,True,False,False,False,False,False,False
Имя_1,False,False,False,False,False,True,False,False,False,False,...,False,False,True,False,False,False,False,False,False,True
Имя_2,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,True,False,False,False
Имя_3,False,False,False,True,True,False,False,False,False,False,...,False,True,False,False,False,False,False,True,False,False
Имя_4,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,False,False,False,True

In [157]:
new_ser = df.set_index('name').agg(lambda x: sum(np.where(x.isin([0.0]), 1, 0)) , axis=1)
new_ser.head()

name
Имя_0     6
Имя_1    10
Имя_2    10
Имя_3    10
Имя_4     8
dtype: int32

In [158]:
# Сколько студентов правильно решили конкретную задачу и среднее значение правильных решений.

new_df = pd.read_csv('data\stud.csv', index_col='name').map(lambda x: 1 if x==1.0 else 0).agg(['sum', 'mean'])
new_df.head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
sum,42.00,42.00,42.00,43.00,39.00,40.0,43.00,44.00,40.0,44.00,...,39.00,37.00,38.00,41.00,35.0,43.00,42.00,41.00,38.00,41.00
mean,0.84,0.84,0.84,0.86,0.78,0.8,0.86,0.88,0.8,0.88,...,0.78,0.74,0.76,0.82,0.7,0.86,0.84,0.82,0.76,0.82

In [159]:
new_df = pd.read_csv('data\stud.csv', index_col='name').fillna(0).agg(['sum', 'mean'])
new_df.head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
sum,42.00,42.00,42.00,43.00,39.00,40.0,43.00,44.00,40.0,44.00,...,39.00,37.00,38.00,41.00,35.0,43.00,42.00,41.00,38.00,41.00
mean,0.84,0.84,0.84,0.86,0.78,0.8,0.86,0.88,0.8,0.88,...,0.78,0.74,0.76,0.82,0.7,0.86,0.84,0.82,0.76,0.82

In [160]:
new_df = pd.read_csv('data\stud.csv', index_col='name').eq(1).agg(['sum', 'mean'])
new_df.head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
sum,42.00,42.00,42.00,43.00,39.00,40.0,43.00,44.00,40.0,44.00,...,39.00,37.00,38.00,41.00,35.0,43.00,42.00,41.00,38.00,41.00
mean,0.84,0.84,0.84,0.86,0.78,0.8,0.86,0.88,0.8,0.88,...,0.78,0.74,0.76,0.82,0.7,0.86,0.84,0.82,0.76,0.82

In [161]:
# Сколько студентов не решили конкретную задачу и среднее значение нерешивших.

new_df = pd.read_csv('data\stud.csv', index_col='name').ne(1).agg(['sum', 'mean'])
new_df.head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
sum,8.00,8.00,8.00,7.00,11.00,10.0,7.00,6.00,10.0,6.00,...,11.00,13.00,12.00,9.00,15.0,7.00,8.00,9.00,12.00,9.00
mean,0.16,0.16,0.16,0.14,0.22,0.2,0.14,0.12,0.2,0.12,...,0.22,0.26,0.24,0.18,0.3,0.14,0.16,0.18,0.24,0.18

In [162]:
new_df = pd.read_csv('data\stud.csv', index_col='name').isin([0, np.nan]).agg(['sum', 'mean'])
new_df.head()

,1,2,3,4,5,6,7,8,9,10,...,41,42,43,44,45,46,47,48,49,50
sum,8.00,8.00,8.00,7.00,11.00,10.0,7.00,6.00,10.0,6.00,...,11.00,13.00,12.00,9.00,15.0,7.00,8.00,9.00,12.00,9.00
mean,0.16,0.16,0.16,0.14,0.22,0.2,0.14,0.12,0.2,0.12,...,0.22,0.26,0.24,0.18,0.3,0.14,0.16,0.18,0.24,0.18

In [163]:
# Сколько студентов правильно решили пятую и среднее значение правильных решений. Воспользуйтесь именованной агрегацией.

new_df = pd.read_csv('data\stud.csv', index_col='name')['5'].eq(1).agg({'sum_solved': 'sum', 'mean_solved': 'mean'}).to_frame()
new_df.head()

                 5
sum_solved   39.00
mean_solved   0.78

# 2.5 Группировка данных. Метод groupby().

In [164]:
df = pd.read_csv('data/users.csv', encoding='UTF-8').drop('Unnamed: 0', axis=1)
df.head()

     user  device        date
0  user_0      PC  2023-01-01
1  user_0   phone  2023-01-02
2  user_1  laptop  2023-01-03
3  user_1      PC  2023-01-04
4  user_2  laptop  2023-01-05

In [165]:
df.shape

(180, 3)

In [166]:
groups = df.groupby(['user', 'device'])
groups

In [167]:
for name, group in groups:
    print(name)
    print(group, end='/n/n')

('user_0', 'PC')
       user device        date
0    user_0     PC  2023-01-01
36   user_0     PC  2023-02-06
72   user_0     PC  2023-03-14
108  user_0     PC  2023-04-19
144  user_0     PC  2023-05-25/n/n('user_0', 'phone')
       user device        date
1    user_0  phone  2023-01-02
37   user_0  phone  2023-02-07
73   user_0  phone  2023-03-15
109  user_0  phone  2023-04-20
145  user_0  phone  2023-05-26/n/n('user_1', 'PC')
       user device        date
3    user_1     PC  2023-01-04
39   user_1     PC  2023-02-09
75   user_1     PC  2023-03-17
111  user_1     PC  2023-04-22
147  user_1     PC  2023-05-28/n/n('user_1', 'laptop')
       user  device        date
2    user_1  laptop  2023-01-03
38   user_1  laptop  2023-02-08
74   user_1  laptop  2023-03-16
110  user_1  laptop  2023-04-21
146  user_1  laptop  2023-05-27/n/n('user_10', 'laptop')
        user  device        date
17   user_10  laptop  2023-01-18
53   user_10  laptop  2023-02-23
89   user_10  laptop  2023-03-31
125  user_10  laptop  2023-05-06
161  user_10  laptop  2023-06-11/n/n('user_10', 'phone')
        user device        date
16   user_10  phone  2023-01-17
52   user_10  phone  2023-02-22
88   user_10  phone  2023-03-30
124  user_10  phone  2023-05-05
160  user_10  phone  2023-06-10/n/n('user_11', 'PC')
        user device        date
19   user_11     PC  2023-01-20
55   user_11     PC  2023-02-25
91   user_11     PC  2023-04-02
127  user_11     PC  2023-05-08
163  user_11     PC  2023-06-13/n/n('user_11', 'laptop')
        user  device        date
18   user_11  laptop  2023-01-19
54   user_11  laptop  2023-02-24
90   user_11  laptop  2023-04-01
126  user_11  laptop  2023-05-07
162  user_11  laptop  2023-06-12/n/n('user_12', 'PC')
        user device        date
20   user_12     PC  2023-01-21
56   user_12     PC  2023-02-26
92   user_12     PC  2023-04-03
128  user_12     PC  2023-05-09
164  user_12     PC  2023-06-14/n/n('user_12', 'laptop')
        user  device        date
21   user_12  laptop  2023-01-22
57   user_12  laptop  2023-02-27
93   user_12  laptop  2023-04-04
129  user_12  laptop  2023-05-10
165  user_12  laptop  2023-06-15/n/n('user_12', 'phone')
        user device        date
22   user_12  phone  2023-01-23
58   user_12  phone  2023-02-28
94   user_12  phone  2023-04-05
130  user_12  phone  2023-05-11
166  user_12  phone  2023-06-16/n/n('user_13', 'laptop')
        user  device        date
23   user_13  laptop  2023-01-24
59   user_13  laptop  2023-03-01
95   user_13  laptop  2023-04-06
131  user_13  laptop  2023-05-12
167  user_13  laptop  2023-06-17/n/n('user_14', 'PC')
        user device        date
24   user_14     PC  2023-01-25
60   user_14     PC  2023-03-02
96   user_14     PC  2023-04-07
132  user_14     PC  2023-05-13
168  user_14     PC  2023-06-18/n/n('user_15', 'PC')
        user device        date
25   user_15     PC  2023-01-26
61   user_15     PC  2023-03-03
97   user_15     PC  2023-04-08
133  user_15     PC  2023-05-14
169  user_15     PC  2023-06-19/n/n('user_15', 'laptop')
        user  device        date
26   user_15  laptop  2023-01-27
62   user_15  laptop  2023-03-04
98   user_15  laptop  2023-04-09
134  user_15  laptop  2023-05-15
170  user_15  laptop  2023-06-20/n/n('user_15', 'phone')
        user device        date
27   user_15  phone  2023-01-28
63   user_15  phone  2023-03-05
99   user_15  phone  2023-04-10
135  user_15  phone  2023-05-16
171  user_15  phone  2023-06-21/n/n('user_16', 'phone')
        user device        date
28   user_16  phone  2023-01-29
64   user_16  phone  2023-03-06
100  user_16  phone  2023-04-11
136  user_16  phone  2023-05-17
172  user_16  phone  2023-06-22/n/n('user_17', 'laptop')
        user  device        date
29   user_17  laptop  2023-01-30
65   user_17  laptop  2023-03-07
101  user_17  laptop  2023-04-12
137  user_17  laptop  2023-05-18
173  user_17  laptop  2023-06-23/n/n('user_17', 'phone')
        user device        date
30   user_17  phone  2023-01-31
66   user_17  phone  2023-03-08
102  user_17  phone  2023-04-13
138  user_17  phone  2023-05-19
174  user_17  phone  2023-06-24/n/n('user_18', 'PC')
        user device        date
32   user_18     PC  2023-02-02
68   user_18     PC  2023-03-10
104  user_18     PC  2023-04-15
140  user_18     PC  2023-05-21
176  user_18     PC  2023-06-26/n/n('user_18', 'laptop')
        user  device        date
31   user_18  laptop  2023-02-01
67   user_18  laptop  2023-03-09
103  user_18  laptop  2023-04-14
139  user_18  laptop  2023-05-20
175  user_18  laptop  2023-06-25/n/n('user_19', 'PC')
        user device        date
33   user_19     PC  2023-02-03
69   user_19     PC  2023-03-11
105  user_19     PC  2023-04-16
141  user_19     PC  2023-05-22
177  user_19     PC  2023-06-27/n/n('user_19', 'laptop')
        user  device        date
34   user_19  laptop  2023-02-04
70   user_19  laptop  2023-03-12
106  user_19  laptop  2023-04-17
142  user_19  laptop  2023-05-23
178  user_19  laptop  2023-06-28/n/n('user_19', 'phone')
        user device        date
35   user_19  phone  2023-02-05
71   user_19  phone  2023-03-13
107  user_19  phone  2023-04-18
143  user_19  phone  2023-05-24
179  user_19  phone  2023-06-29/n/n('user_2', 'laptop')
       user  device        date
4    user_2  laptop  2023-01-05
40   user_2  laptop  2023-02-10
76   user_2  laptop  2023-03-18
112  user_2  laptop  2023-04-23
148  user_2  laptop  2023-05-29/n/n('user_3', 'PC')
       user device        date
5    user_3     PC  2023-01-06
41   user_3     PC  2023-02-11
77   user_3     PC  2023-03-19
113  user_3     PC  2023-04-24
149  user_3     PC  2023-05-30/n/n('user_3', 'phone')
       user device        date
6    user_3  phone  2023-01-07
42   user_3  phone  2023-02-12
78   user_3  phone  2023-03-20
114  user_3  phone  2023-04-25
150  user_3  phone  2023-05-31/n/n('user_4', 'PC')
       user device        date
7    user_4     PC  2023-01-08
43   user_4     PC  2023-02-13
79   user_4     PC  2023-03-21
115  user_4     PC  2023-04-26
151  user_4     PC  2023-06-01/n/n('user_4', 'laptop')
       user  device        date
8    user_4  laptop  2023-01-09
44   user_4  laptop  2023-02-14
80   user_4  laptop  2023-03-22
116  user_4  laptop  2023-04-27
152  user_4  laptop  2023-06-02/n/n('user_4', 'phone')
       user device        date
9    user_4  phone  2023-01-10
45   user_4  phone  2023-02-15
81   user_4  phone  2023-03-23
117  user_4  phone  2023-04-28
153  user_4  phone  2023-06-03/n/n('user_5', 'phone')
       user device        date
10   user_5  phone  2023-01-11
46   user_5  phone  2023-02-16
82   user_5  phone  2023-03-24
118  user_5  phone  2023-04-29
154  user_5  phone  2023-06-04/n/n('user_6', 'laptop')
       user  device        date
11   user_6  laptop  2023-01-12
12   user_6  laptop  2023-01-13
47   user_6  laptop  2023-02-17
48   user_6  laptop  2023-02-18
83   user_6  laptop  2023-03-25
84   user_6  laptop  2023-03-26
119  user_6  laptop  2023-04-30
120  user_6  laptop  2023-05-01
155  user_6  laptop  2023-06-05
156  user_6  laptop  2023-06-06/n/n('user_7', 'PC')
       user device        date
13   user_7     PC  2023-01-14
49   user_7     PC  2023-02-19
85   user_7     PC  2023-03-27
121  user_7     PC  2023-05-02
157  user_7     PC  2023-06-07/n/n('user_8', 'PC')
       user device        date
14   user_8     PC  2023-01-15
50   user_8     PC  2023-02-20
86   user_8     PC  2023-03-28
122  user_8     PC  2023-05-03
158  user_8     PC  2023-06-08/n/n('user_9', 'PC')
       user device        date
15   user_9     PC  2023-01-16
51   user_9     PC  2023-02-21
87   user_9     PC  2023-03-29
123  user_9     PC  2023-05-04
159  user_9     PC  2023-06-09/n/n

In [168]:
# Показать индекс столбца группировки

df.groupby('device', as_index=False).count()

   device  user  date
0      PC    65    65
1  laptop    65    65
2   phone    50    50

In [169]:
df.groupby('device')['date'].count()

device
PC        65
laptop    65
phone     50
Name: date, dtype: int64

In [170]:
df.groupby('device', as_index=False).agg(min_date=('date', 'min'))

   device    min_date
0      PC  2023-01-01
1  laptop  2023-01-03
2   phone  2023-01-02

In [171]:
# Задача

N_client = 10
N_product = 15

client = {i: f'client_{i}' for i in range(N_client)}
product = {i: f'product_{i}' for i in range(N_product )}
price = {i: (i+1)*1000 for i in range(N_product)}

client_list = np.random.randint(0, N_client, 100)
product_list = np.random.randint(0, N_product , 100)

df = pd.DataFrame({'client': client_list,
                   'product': product_list,
                   'price': product_list}).replace({'client': client, 'product': product, 'price': price})
print(df.shape)
df.head()

(100, 3)

     client     product  price
0  client_4   product_2   3000
1  client_7  product_13  14000
2  client_9   product_6   7000
3  client_7   product_0   1000
4  client_8   product_8   9000

In [172]:
# Подсчитайте сумму которую потратил каждый клиент. Результат запишите в переменную new_ser, он должен быть представлен в виде серии данных.

new_ser = df.groupby('client')['price'].agg('sum')
new_ser.head()

client
client_0    43000
client_1    95000
client_2    45000
client_3    60000
client_4    96000
Name: price, dtype: int32

In [173]:
# Подсчитайте сколько товаров купил каждый клиент. Результат запишите в переменную new_ser, он должен быть представлен в виде серии данных.

new_ser = df.groupby('client')['product'].agg('count')
new_ser.head()

client
client_0     7
client_1    12
client_2     5
client_3     7
client_4    11
Name: product, dtype: int64

In [174]:
# Подсчитайте какое количество разных товаров купил каждый клиент. Результат запишите в переменную new_ser.

new_ser = df.groupby(['client'])['product'].nunique()
new_ser

client
client_0    4
client_1    9
client_2    4
client_3    5
client_4    8
client_5    9
client_6    9
client_7    9
client_8    8
client_9    7
Name: product, dtype: int64

In [175]:
# Подсчитайте для каждого клиента какие товары и сколько раз он их покупал. Столбец с количеством покупок назовите "count". Результат запишите в переменную new_df.

new_df = df.groupby(['client', 'product'], as_index=False).count().rename({'price': 'count'}, axis=1)
new_df.head()

     client     product  count
0  client_0   product_0      4
1  client_0  product_11      1
2  client_0  product_12      1
3  client_0  product_13      1
4  client_1   product_1      3

In [176]:
new_df = df.groupby(['client', 'product'], as_index = False).agg(count=('product', 'count'))
new_df.head()

     client     product  count
0  client_0   product_0      4
1  client_0  product_11      1
2  client_0  product_12      1
3  client_0  product_13      1
4  client_1   product_1      3

In [177]:
# Подсчитайте сколько раз покупали и сколько было потрачено на каждый товар всеми клиентами. 
# Столбец с количеством покупок назовите "count", а столбец с суммой потраченных денег "sum_price". 
# Результат запишите в переменную new_df.

new_df = df.groupby(['product']).agg(count=('product', 'count'),
                                                                 sum_price=('price', 'sum'))
new_df.head()

            count  sum_price
product
product_0      12      12000
product_1      10      20000
product_10      6      66000
product_11      9     108000
product_12      7      91000

In [178]:
# Каждому продукту сопоставьте массив содержащий клиентов (массив с уникальными значениями), которые этот товар покупали. Результат запишите в переменную new_ser.

new_ser = df.groupby('product')['client'].unique()
new_ser

product
product_0     [client_7, client_0, client_9, client_8, clien...
product_1     [client_5, client_1, client_8, client_9, clien...
product_10             [client_6, client_4, client_7, client_1]
product_11    [client_6, client_2, client_7, client_5, clien...
product_12    [client_7, client_9, client_4, client_5, clien...
product_13    [client_7, client_1, client_8, client_0, clien...
product_14                       [client_7, client_3, client_1]
product_2                                  [client_4, client_6]
product_3     [client_6, client_5, client_8, client_1, clien...
product_4              [client_7, client_1, client_4, client_6]
product_5     [client_9, client_4, client_3, client_7, clien...
product_6     [client_9, client_6, client_3, client_1, clien...
product_7                        [client_5, client_4, client_6]
product_8     [client_8, client_4, client_6, client_2, clien...
product_9     [client_1, client_9, client_2, client_3, clien...
Name: client, dtype: object

# Применение метода apply().

In [179]:
# В уроке про метод apply() говорилось, что в функцию, которая используется в методе, передается либо серия, либо массив Numpy, либо значения серии. 
# При использовании apply() совместно с groupby() в функцию будет целиком передаваться тот объект, который возвращает groupby().

# К примеру, df.groupby(...)["col_2"].apply( my_func ) при такой записи в my_func будет поочереди из каждой группы передан столбец "col_2" в виде серии. 
# Если записать так df.groupby(...)[["col_2"]].apply( my_func ), обратите внимание на двойные квадратные скобки, 
# в my_func будет поочереди из каждой группы передан столбец "col_2" уже в виде DataFrame.

In [180]:
# Подсчитайте сколько раз каждый клиент покупал "product_2". 
# Данные представьте в виде DF. 
# Столбец с количеством покупок назовите "product_2". 
# Результат запишите в переменную new_df.

df_new = df.copy()
df_new['product'] = df_new['product'].eq('product_2')
df_new.groupby('client')[['product']].agg(product_2=('product', 'sum'))

          product_2
client
client_0          0
client_1          0
client_2          0
client_3          0
client_4          1
client_5          0
client_6          1
client_7          0
client_8          0
client_9          0

In [181]:
df.groupby('client')[['product']].apply(lambda x: x.isin(['product_2']).sum()).rename(columns={'product':'product_2'})

          product_2
client
client_0          0
client_1          0
client_2          0
client_3          0
client_4          1
client_5          0
client_6          1
client_7          0
client_8          0
client_9          0

In [182]:
df.groupby('client')['product'].apply(lambda x: (x == 'product_2').sum()).to_frame('product_2')

          product_2
client
client_0          0
client_1          0
client_2          0
client_3          0
client_4          1
client_5          0
client_6          1
client_7          0
client_8          0
client_9          0

In [183]:
# Задача

df = pd.read_csv('data/users.csv').drop('Unnamed: 0', axis=1)
df.head()

     user  device        date
0  user_0      PC  2023-01-01
1  user_0   phone  2023-01-02
2  user_1  laptop  2023-01-03
3  user_1      PC  2023-01-04
4  user_2  laptop  2023-01-05

In [184]:
# Получите список\массив пользователей, которые заходили в приложение только с персонального компьютера('PC').

new_df = df.groupby('user')[['device']].agg(lambda x: x.isin(['PC']).all())
user_list = new_df[new_df['device']].index.to_list()
user_list

['user_14', 'user_7', 'user_8', 'user_9']

In [185]:
users = df.groupby('user')['device'].unique().to_frame()
user_list = users.loc[users['device'].astype(str) == "['PC']"].index.to_list()
user_list

['user_14', 'user_7', 'user_8', 'user_9']

In [186]:
ser = df.groupby('user')['device'].unique()
user_list = ser[ser.isin([['PC']])].index.to_list()
user_list

['user_14', 'user_7', 'user_8', 'user_9']

In [187]:
# Получите список\массив пользователей, которые заходили в приложение со всех устройств.

users = df.groupby('user')['device'].unique().to_frame()
user_list = users.loc[users['device'].astype(str) == "['PC' 'laptop' 'phone']"].index.to_list()
user_list

['user_12', 'user_15', 'user_19', 'user_4']

In [188]:
df = pd.read_csv('data/users.csv')
new_df = df.groupby('user')['device'].unique().apply(lambda x: len(x)==3)
user_list = new_df[new_df].index.to_list()
user_list

['user_12', 'user_15', 'user_19', 'user_4']

In [189]:
df = pd.read_csv('data/users_action.csv').drop('Unnamed: 0', axis=1)
print(df.shape)
df.head()

(145, 4)

     user  device        date  action
0  user_0  laptop  2023-01-01    True
1  user_1      PC  2023-01-02    True
2  user_1  laptop  2023-01-03    True
3  user_1   phone  2023-01-04    True
4  user_2      PC  2023-01-05   False

In [190]:
# Получите DF, показывающий, сколько раз пользователи совершали целевое действие, зайдя в приложение со смартфона

df.loc[df['device'] == 'phone'].groupby('user').agg(action_True=('action', 'sum'))

         action_True
user
user_1             3
user_13            0
user_17            2
user_19            3
user_6             2
user_9             3

In [191]:
# Подсчитайте сколько раз каждый клиент покупал "product_3" 
# и сколько он потратил денег на этот товар. Данные представьте в виде DF. 
# Столбец с количеством покупок назовите "product_3", а столбец с суммой потраченных денег "sum_price". 
# Результат запишите в переменную new_df.

N_client = 10
N_product = 15

client = {i: f'client_{i}' for i in range(N_client)}
product = {i: f'product_{i}' for i in range(N_product )}
price = {i: (i+1)*1000 for i in range(N_product)}

client_list = np.random.randint(0, N_client, 100)
product_list = np.random.randint(0, N_product , 100)

df = pd.DataFrame({'client': client_list,
                   'product': product_list,
                   'price': product_list}).replace({'client': client, 'product': product, 'price': price})
print(df.shape)
df.head()

(100, 3)

     client    product  price
0  client_3  product_8   9000
1  client_6  product_5   6000
2  client_0  product_8   9000
3  client_0  product_6   7000
4  client_4  product_1   2000

In [192]:
product3_indexes_not = df.loc[~(df['product'] == 'product_3')].index
product3_indexes_not

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 11, 12, 13, 14, 15, 17, 18, 19,
       20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31, 32, 33, 34, 35, 36, 37, 39,
       40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57,
       58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 75, 76,
       77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 91, 92, 93, 94, 95, 96,
       97, 98],
      dtype='int64')

In [193]:
product3_indexes = df.loc[(df['product'] == 'product_3')].index
product3_indexes

Index([10, 16, 30, 38, 74, 89, 90, 99], dtype='int64')

In [194]:
df.loc[product3_indexes_not, ['product', 'price']] = [0, 0]

In [195]:
df.loc[product3_indexes, 'product'] = 1

In [196]:
df.value_counts()

client    product  price
client_7  0        0        13
client_3  0        0        11
client_8  0        0        10
client_9  0        0        10
client_0  0        0         9
client_4  0        0         9
client_1  0        0         8
client_5  0        0         8
client_6  0        0         8
client_2  0        0         6
client_6  1        4000      3
client_0  1        4000      1
client_3  1        4000      1
client_4  1        4000      1
client_8  1        4000      1
client_9  1        4000      1
Name: count, dtype: int64

In [197]:
df.groupby('client').agg(product3 = ('product', 'sum'),
                         sum_price = ('price', 'sum'))

         product3  sum_price
client
client_0        1       4000
client_1        0          0
client_2        0          0
client_3        1       4000
client_4        1       4000
client_5        0          0
client_6        3      12000
client_7        0          0
client_8        1       4000
client_9        1       4000

In [198]:
# Подсчитайте сколько раз каждый клиент покупал "product_3" 
# и сколько он потратил денег на этот товар. Данные представьте в виде DF. 
# Столбец с количеством покупок назовите "product_3", а столбец с суммой потраченных денег "sum_price". 
# Результат запишите в переменную new_df.

N_client = 10
N_product = 15

client = {i: f'client_{i}' for i in range(N_client)}
product = {i: f'product_{i}' for i in range(N_product )}
price = {i: (i+1)*1000 for i in range(N_product)}

client_list = np.random.randint(0, N_client, 100)
product_list = np.random.randint(0, N_product , 100)

df = pd.DataFrame({'client': client_list,
                   'product': product_list,
                   'price': product_list}).replace({'client': client, 'product': product, 'price': price})
print(df.shape)
df.loc[df['product'] == 'product_3']

(100, 3)

      client    product  price
3   client_7  product_3   4000
22  client_4  product_3   4000
25  client_8  product_3   4000
27  client_8  product_3   4000
33  client_5  product_3   4000
38  client_2  product_3   4000
51  client_6  product_3   4000
81  client_7  product_3   4000

In [199]:
def func(x):
    return x[x['product'] == 'product_3'].agg({'product': 'count', 'price': 'sum'})

df.groupby('client')[['product', 'price']].apply(func) \
    .rename(columns={'product': 'product_3', 'price': 'sum_price'})

          product_3  sum_price
client
client_0          0          0
client_1          0          0
client_2          1       4000
client_3          0          0
client_4          1       4000
client_5          1       4000
client_6          1       4000
client_7          2       8000
client_8          2       8000
client_9          0          0

In [200]:
df.groupby('client').apply(lambda x: x[x['product']=='product_3'].agg({'product': 'count','price': 'sum'}))

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\825828499.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('client').apply(lambda x: x[x['product']=='product_3'].agg({'product': 'count','price': 'sum'}))

          product  price
client
client_0        0      0
client_1        0      0
client_2        1   4000
client_3        0      0
client_4        1   4000
client_5        1   4000
client_6        1   4000
client_7        2   8000
client_8        2   8000
client_9        0      0

# 2.3 Методы apply().

In [201]:
dict_array = {f'col_{i}': [i*1, i*2, i*3, i*4, i*5] if i !=3 else [i]*5 for i in range(5)}
dict_array

{'col_0': [0, 0, 0, 0, 0],
 'col_1': [1, 2, 3, 4, 5],
 'col_2': [2, 4, 6, 8, 10],
 'col_3': [3, 3, 3, 3, 3],
 'col_4': [4, 8, 12, 16, 20]}

In [202]:
df = pd.DataFrame(dict_array)
df

   col_0  col_1  col_2  col_3  col_4
0      0      1      2      3      4
1      0      2      4      3      8
2      0      3      6      3     12
3      0      4      8      3     16
4      0      5     10      3     20

In [203]:
# DataFrame.apply(func, axis=0, raw=False, result_type=None, agrs=(), **kwargs)

# Series.apply(func, axis=0, agrs=(), **kwargs)

In [204]:
def my_func(series):
    if series.name == 'col_2':
        return series*0
    return series

df.apply(my_func)

   col_0  col_1  col_2  col_3  col_4
0      0      1      0      3      4
1      0      2      0      3      8
2      0      3      0      3     12
3      0      4      0      3     16
4      0      5      0      3     20

In [205]:
df.apply(lambda x: x+100 if x.name != 'col_2' else x*0)

   col_0  col_1  col_2  col_3  col_4
0    100    101      0    103    104
1    100    102      0    103    108
2    100    103      0    103    112
3    100    104      0    103    116
4    100    105      0    103    120

In [206]:
df

   col_0  col_1  col_2  col_3  col_4
0      0      1      2      3      4
1      0      2      4      3      8
2      0      3      6      3     12
3      0      4      8      3     16
4      0      5     10      3     20

In [207]:
# raw=True - передача массива numpy вместо Series (работает быстрее)

df.apply('sum', axis=0, raw=True)

col_0     0
col_1    15
col_2    30
col_3    15
col_4    60
dtype: int64

In [208]:
dict_array = {'age': [53, 25, 11, 18, 7],
              'name': [f'Фамилия_{i} Имя_{i}' for i in range(1,6)],
              'наличие авто': [True, True, False, True, False]}
dict_array['name'][1] = 'Фамилия_2 Имя_2 Отчество_2'
df = pd.DataFrame(dict_array)
df

   age                        name  наличие авто
0   53             Фамилия_1 Имя_1          True
1   25  Фамилия_2 Имя_2 Отчество_2          True
2   11             Фамилия_3 Имя_3         False
3   18             Фамилия_4 Имя_4          True
4    7             Фамилия_5 Имя_5         False

In [209]:
# Добавление в df столбцов Имя, Фамилия, Отчетство

def my_func(series):
    name_split = series.str.split()[0]

    if len(name_split) == 2:
        name_split.append(np.nan)
        
    return name_split

df[['name']].apply(my_func, axis=1, result_type='expand')

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3318162724.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  name_split = series.str.split()[0]

           0      1           2
0  Фамилия_1  Имя_1         NaN
1  Фамилия_2  Имя_2  Отчество_2
2  Фамилия_3  Имя_3         NaN
3  Фамилия_4  Имя_4         NaN
4  Фамилия_5  Имя_5         NaN

In [210]:
df[['first_name', 'last_name', 'patronymic']] = df[['name']].apply(my_func, axis=1, result_type='expand')
df

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3318162724.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  name_split = series.str.split()[0]

,age,name,наличие авто,first_name,last_name,patronymic
0,53,Фамилия_1 Имя_1,True,Фамилия_1,Имя_1,NaN
1,25,Фамилия_2 Имя_2 Отчество_2,True,Фамилия_2,Имя_2,Отчество_2
2,11,Фамилия_3 Имя_3,False,Фамилия_3,Имя_3,NaN
3,18,Фамилия_4 Имя_4,True,Фамилия_4,Имя_4,NaN
4,7,Фамилия_5 Имя_5,False,Фамилия_5,Имя_5,NaN

In [211]:
print(df['name'].apply(lambda x: x.split()[1]))
print()
print(df['name'].apply(lambda x: x.split()[-1] if len(x.split())==3 else np.nan))

0    Имя_1
1    Имя_2
2    Имя_3
3    Имя_4
4    Имя_5
Name: name, dtype: object

0           NaN
1    Отчество_2
2           NaN
3           NaN
4           NaN
Name: name, dtype: object

In [212]:
def my_func(series, *args, flag=False):
    if not isinstance(series, pd.Series):
        raise Exception("Передана не pandas.Series")
    if len(args) == 0:
        return '---'
    if len(args) > 3:
        raise Exception("Аргументов больше 3")
    
    name_split = series.str.split(' ')[0]
    if len(name_split) == 2:
        name_split.append(np.nan)
        
    N = {'Ф': 0,
         'И': 1,
         'О': 2}
    res = [ name_split[N[arg]] for arg in args if arg in N ]
    if flag:
        res.append(f"{'' if name_split[0] is np.nan else name_split[0]} {'' if name_split[1] is np.nan else name_split[1][0] + '.'} {'' if name_split[2] is np.nan else name_split[2][0] + '.'}")
    
    return res

In [213]:
df[['name']].apply(my_func, axis=1, result_type='expand', args=('', 'Ф', 'И'), flag=True)

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\2143492344.py:9: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  name_split = series.str.split(' ')[0]

           0      1                2
0  Фамилия_1  Имя_1    Фамилия_1 И.
1  Фамилия_2  Имя_2  Фамилия_2 И. О.
2  Фамилия_3  Имя_3    Фамилия_3 И.
3  Фамилия_4  Имя_4    Фамилия_4 И.
4  Фамилия_5  Имя_5    Фамилия_5 И.

In [214]:
def split_fio(row, *args, **kwargs):
    f_spl = (row.str.split()[0] + [np.NaN] * 2)[:3]
    p_arg = dict(map(lambda x: x[::-1], enumerate('ФИО')))
    fio = [f_spl[p_arg[arg]] for arg in args if arg in p_arg]
    if kwargs.get('flag', False):
        fio_ = ' '.join([f_spl[0], ''.join(f'{s[0]}.' for s in f_spl[1:] if isinstance(s, str))])
        fio.append(fio_)
    return fio


df[['name']].apply(split_fio, axis=1, result_type='expand',
                         args=('О', 'И', 'что-то'), flag=True)

C:\Users\kuche\AppData\Local\Temp\ipykernel_18800\3691608679.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  f_spl = (row.str.split()[0] + [np.NaN] * 2)[:3]

            0      1               2
0         NaN  Имя_1    Фамилия_1 И.
1  Отчество_2  Имя_2  Фамилия_2 И.О.
2         NaN  Имя_3    Фамилия_3 И.
3         NaN  Имя_4    Фамилия_4 И.
4         NaN  Имя_5    Фамилия_5 И.

In [215]:
# Дана функция, в которую первым аргументом передают серию данных:

# def my_func(series, a, b=True, c=None):
#     ...
#     ...
#     ...

# Аргумент a может принимать любое значение, именованный аргумент b принимает значение True или False, а в аргумент c можно передавать только строки.

# df.apply(my_func, args=(100,), b=False, c='45')
# df.apply(my_func, args=(100,), b=False)

# Первый аргумент должен быть кортежем, остальные - именные (явно заданные)

In [216]:
df = pd.DataFrame(['city_1', 'city_2', 'city_1', 'city_1', 'city_3'], columns=['cities'])
df

   cities
0  city_1
1  city_2
2  city_1
3  city_1
4  city_3

In [217]:
df['cities'].apply(lambda x: 0 if x=='city_1' else 1)

0    0
1    1
2    0
3    0
4    1
Name: cities, dtype: int64

In [218]:
# Задача

df = (pd.DataFrame({'кол-во жителей': [100000, 200000, 20000, 30000, 31000], 
                    'city': ['Name_1', 'Name_2', 'Name_3', 'Name_4', 'Name_5']}))
df

   кол-во жителей    city
0          100000  Name_1
1          200000  Name_2
2           20000  Name_3
3           30000  Name_4
4           31000  Name_5

In [219]:
# Населенный пункт приобретает статус: "город" - если число жителей больше 30000; "поселок городского типа" - если не больше 30000. 
# Поставьте (через пробел) соответствующий статус у названия города.

def get_status(series):
    if series['кол-во жителей'] > 30000:
        series['city'] = 'город ' + series['city']
    else:
        series['city'] = 'поселок городского типа ' + series['city']
    return series[['кол-во жителей', 'city']]

df.apply(get_status, axis=1)

   кол-во жителей                            city
0          100000                    город Name_1
1          200000                    город Name_2
2           20000  поселок городского типа Name_3
3           30000  поселок городского типа Name_4
4           31000                    город Name_5

In [220]:
df.apply(lambda x: f'город {x.iloc[1]}' if x.iloc[0] > 30000 else f'поселок городского типа {x.iloc[1]}', axis=1)

0                      город Name_1
1                      город Name_2
2    поселок городского типа Name_3
3    поселок городского типа Name_4
4                      город Name_5
dtype: object

In [221]:
df[['city', 'кол-во жителей']].apply(lambda x: f"город {x['city']}" if x['кол-во жителей'] > 30000 else f"поселок городского типа {x['city']}", axis=1)

0                      город Name_1
1                      город Name_2
2    поселок городского типа Name_3
3    поселок городского типа Name_4
4                      город Name_5
dtype: object

In [222]:
#Задача

dtypes = {i: j for (i, j) in zip([f'col_{i}' for i in range(1, 6)],['int64', 'int32', 'float32', 'int32', 'int64'])}

df = pd.DataFrame(np.random.randint(0, 10, size=(4, 5)), columns=[f'col_{i}' for i in range(1, 6)])

df = df.astype(dtypes)
df

   col_1  col_2  col_3  col_4  col_5
0      7      7    1.0      0      9
1      0      7    8.0      5      6
2      8      9    8.0      0      4
3      7      9    0.0      4      7

In [223]:
df.dtypes

col_1      int64
col_2      int32
col_3    float32
col_4      int32
col_5      int64
dtype: object

In [224]:
# В столбцах с типом данных 'int64' измените тип данных на 'int32

def change_type(series):
    if series.dtype == 'int64':
        return series.astype('int32')
    return series.astype(series.dtype)

df.apply(change_type).dtypes

col_1      int32
col_2      int32
col_3    float32
col_4      int32
col_5      int32
dtype: object

In [225]:
df.apply(lambda x: x.astype('int32') if x.dtype == 'int64' else x, axis = 0).dtypes

col_1      int32
col_2      int32
col_3    float32
col_4      int32
col_5      int32
dtype: object

In [226]:
# Задача

df = pd.DataFrame({'year_1': np.random.randint(0, 10, size=5), 
                   'year_2': np.random.randint(0, 10, size=5), 
                   'col_3': np.random.randint(0, 10, size=5), 
                   'year_4': np.random.randint(0, 10, size=5), 
                   'col_5': np.random.randint(0, 10, size=5), 
                   'year_6': np.random.randint(0, 10, size=5)})
df

   year_1  year_2  col_3  year_4  col_5  year_6
0       8       2      3       7      0       4
1       9       3      1       5      4       6
2       4       3      2       3      6       9
3       7       6      7       7      0       0
4       2       0      7       5      9       3

In [227]:
# К значениям в столбцах ['year_1', 'year_2', 'year_3', 'year_4', 'year_5', 'year_6', 'year_7', 'year_8'] прибавьте 2000

df.apply(lambda x: x + 2000 if x.name in ['year_1', 'year_2', 'year_3', 'year_4', 'year_5', 'year_6', 'year_7', 'year_8'] else x)

   year_1  year_2  col_3  year_4  col_5  year_6
0    2008    2002      3    2007      0    2004
1    2009    2003      1    2005      4    2006
2    2004    2003      2    2003      6    2009
3    2007    2006      7    2007      0    2000
4    2002    2000      7    2005      9    2003

In [228]:
# Задача

N_product = 15

product = {i: f'product_{i}' for i in range(N_product )}
price = {i: (i+1)*200 for i in range(N_product)}


product_list = np.random.randint(0, N_product, 100)
buy_list = np.random.randint(0, 2, 100, bool)
count_list = np.random.randint(0, 10, 100)

df = pd.DataFrame({'product': product_list,
                   'product_price': product_list,
                   'count': count_list,
                   'buy': buy_list}).replace({'product': product, 'product_price': price})
print(df.shape)
df.head()

(100, 4)

      product  product_price  count    buy
0   product_0            200      6  False
1  product_11           2400      8  False
2   product_9           2000      7   True
3   product_6           1400      3  False
4   product_1            400      8   True

In [229]:
# Добавьте еще один столбец 'price', который содержит сумму всей покупки, если она совершена, и np.nan, если покупка не совершена.

df['price'] = df[['product_price', 'count', 'buy']].apply(lambda x: x['product_price'] * x['count'] if x['buy'] else np.nan, axis=1)
df.head()

      product  product_price  count    buy    price
0   product_0            200      6  False      NaN
1  product_11           2400      8  False      NaN
2   product_9           2000      7   True  14000.0
3   product_6           1400      3  False      NaN
4   product_1            400      8   True   3200.0

In [230]:
# Если цена товара меньше 1500, то в 'count' записать 5, если от 1500 до 3000 включительно, то в 'count' записать 3, а если больше 3000, то в 'count' записать 1.

df[['product_price', 'count']].apply(lambda x: 5 if x['product_price'] < 1500 else 3 if (x['product_price'] >= 1500 and x['product_price'] <= 3000) else 1, axis=1).to_frame().head()

   0
0  5
1  3
2  3
3  5
4  5

In [231]:
# Если цена товара меньше 1500, то заменить ее на строку 'Покупать', если от 1500 до 3000 включительно, то заменить на строку 'Есть над чем подумать', 
# а если больше 3000, то заменить на строку 'И думать нечего, не брать'.

df['product_price'].apply(lambda x: f'Покупать' if x < 1500 else 'Есть над чем подумать' if (x >= 1500 and x <= 3000) else 'И думать нечего, не брать').to_frame().head(5)

           product_price
0               Покупать
1  Есть над чем подумать
2  Есть над чем подумать
3               Покупать
4               Покупать

In [232]:
df['product_price'].apply(lambda x: ['Покупать', 'Есть над чем подумать', 'И думать нечего, не брать'][(x >= 1500) + (x > 3000)]).to_frame().head()

           product_price
0               Покупать
1  Есть над чем подумать
2  Есть над чем подумать
3               Покупать
4               Покупать

In [233]:
# В столбце 'buy' значение False замените на 'Не оплачено', а значение True на 'Оплачено'.

df['buy'].apply(lambda x: ['Не оплачено', 'Оплачено'][x]).to_frame().head()

           buy
0  Не оплачено
1  Не оплачено
2     Оплачено
3  Не оплачено
4     Оплачено

In [234]:
# Реализуйте функционал, при котором можно выбирать товар для которого будет подсчитываться значение в столбце 'price'. 
# Если товар не указывать , значения в столбце 'price' будет посчитано как указано выше.

# Пример:

# def func(...):
#     ...
#     ...
#     ...

# df['price'] = df.apply(func, ..., prod='товар_1')

In [235]:
# В DF содержится 'product' - имя товара, 'product_price' - цена товара,  'count' - количество товаров в корзине, 'buy' - произведена покупка или нет. 
# Добавьте еще один столбец 'price', который содержит сумму всей покупки, если она совершена, и np.nan, если покупка не совершена.
# Реализуйте функционал, при котором можно выбирать товар для которого будет подсчитываться значение в столбце 'price'.
# В переменную prod запишите df дополнительно не указывая товар. В переменную prod_3 запишите df дополнительно указав 'товар_3'.

products = [f'товар_{np.random.randint(0, 5)}' for _ in range(100)]
counts = [np.random.randint(1, 5) for _ in range(100)]
buys = [(True, False)[np.random.randint(2)] for _ in range(100)]
df = pd.DataFrame({'product': products,
                   'count': counts,
                   'buy': buys})

df.insert(loc=1, column='product_price', value=df['product'].apply(lambda x: 1000 if x=='товар_0' \
                                                                        else 2000 if x=='товар_1' \
                                                                        else 3000 if x=='товар_2' \
                                                                        else 4000 if x=='товар_3' \
                                                                        else 5000))

df

    product  product_price  count    buy
0   товар_3           4000      1  False
1   товар_0           1000      2  False
2   товар_3           4000      1   True
3   товар_0           1000      1   True
4   товар_4           5000      1  False
..      ...            ...    ...    ...
95  товар_1           2000      4  False
96  товар_3           4000      4  False
97  товар_3           4000      1  False
98  товар_2           3000      2  False
99  товар_0           1000      1   True

[100 rows x 4 columns]

In [236]:
def func(ser, prod = ['товар_3', 'товар_2', 'товар_1', 'товар_0', 'товар_4']):
    if ser['product'] in prod and ser['buy']:
        return float(ser['product_price'] * ser['count'])

In [237]:
df_new = df.copy()
df_new['price'] = df_new.apply(func, axis=1, prod='товар_3')
df_new

    product  product_price  count    buy   price
0   товар_3           4000      1  False     NaN
1   товар_0           1000      2  False     NaN
2   товар_3           4000      1   True  4000.0
3   товар_0           1000      1   True     NaN
4   товар_4           5000      1  False     NaN
..      ...            ...    ...    ...     ...
95  товар_1           2000      4  False     NaN
96  товар_3           4000      4  False     NaN
97  товар_3           4000      1  False     NaN
98  товар_2           3000      2  False     NaN
99  товар_0           1000      1   True     NaN

[100 rows x 5 columns]

In [238]:
df_new['price'] = df_new.apply(func, axis=1)
df_new

    product  product_price  count    buy   price
0   товар_3           4000      1  False     NaN
1   товар_0           1000      2  False     NaN
2   товар_3           4000      1   True  4000.0
3   товар_0           1000      1   True  1000.0
4   товар_4           5000      1  False     NaN
..      ...            ...    ...    ...     ...
95  товар_1           2000      4  False     NaN
96  товар_3           4000      4  False     NaN
97  товар_3           4000      1  False     NaN
98  товар_2           3000      2  False     NaN
99  товар_0           1000      1   True  1000.0

[100 rows x 5 columns]

In [239]:
def func(row, prod = None):
    row['price'] = np.nan
    if (prod is None or prod == row['product']) and row['buy']:
        row['price'] = row['product_price'] * row['count']
    return row

In [240]:
prod = df.apply(func, axis = 1)
prod_3 = df.apply(func, axis = 1, prod ='товар_3')
display(prod.head(), prod_3.head())

   product  product_price  count    buy   price
0  товар_3           4000      1  False     NaN
1  товар_0           1000      2  False     NaN
2  товар_3           4000      1   True  4000.0
3  товар_0           1000      1   True  1000.0
4  товар_4           5000      1  False     NaN

   product  product_price  count    buy   price
0  товар_3           4000      1  False     NaN
1  товар_0           1000      2  False     NaN
2  товар_3           4000      1   True  4000.0
3  товар_0           1000      1   True     NaN
4  товар_4           5000      1  False     NaN

# 2.6 Объединение данных. Методы concat(), merge().

In [241]:
# Concat

In [242]:
df1 = pd.DataFrame({"A":	["A0",	"A1",	"A2",	"A3"],
                    "B":	["B0",	"B1",	"B2",	"B3"],
                    "C":	["CO",	"C1",	"C2",	"C3"],
                    "D":	["D0",	"D1",	"D2",	"D3"]},
                    index=[0, 1, 2, 3])

df2 = pd.DataFrame({"A":	["A4",	"A5",	"A6",	"A7"],
                    "B":	["B4",	"B5",	"B6",	"B7"],
                    "C":	["C4",	"C5",	"C6",	"C7"],
                    "D":	["D4",	"D5",	"D6",	"D7"]},
                    index=[1, 2, 3, 4])

df3 = pd.DataFrame({"A":	["A8",	"A9",	"A10",	"A11"],
                    "B":	["B8",	"B9",	"B10",	"B11"],
                    "C":	["C8",	"C9",	"C10",	"C11"],
                    "D":	["D8",	"D9",	"D10",	"D11"]},
                    index=[2, 3, 4, 5])

In [243]:
pd.concat([df1, df2, df3])

     A    B    C    D
0   A0   B0   CO   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
1   A4   B4   C4   D4
2   A5   B5   C5   D5
3   A6   B6   C6   D6
4   A7   B7   C7   D7
2   A8   B8   C8   D8
3   A9   B9   C9   D9
4  A10  B10  C10  D10
5  A11  B11  C11  D11

In [244]:
pd.concat([df1, df2, df3], ignore_index=True)

      A    B    C    D
0    A0   B0   CO   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [245]:
pd.concat([df1, df2, df3], axis=1)

     A    B    C    D    A    B    C    D    A    B    C    D
0   A0   B0   CO   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1   A4   B4   C4   D4  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2   A5   B5   C5   D5   A8   B8   C8   D8
3   A3   B3   C3   D3   A6   B6   C6   D6   A9   B9   C9   D9
4  NaN  NaN  NaN  NaN   A7   B7   C7   D7  A10  B10  C10  D10
5  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [246]:
# Merge

# pd.merge(left_df, right_df, ...) - функция

# left_df.merge(ight_df, ...) - метод

In [247]:
df_1 = pd.DataFrame({'client_id': [100103, 21990, 455323, 100103, 21990, 455232, 4555323, 21990, 455323],
                     'product': ['product_2', 'product_2', 'product_1', 'product_1',' product_1', 'product_3', 'product_3', 'product_3', 'product_6']})

df_2 = pd.DataFrame({'product': ['product_1', 'product_2', 'product_3', 'product_4',' product_5'],
                     'price': [1000, 2000, 3000, 4000, 5000]})

In [248]:
print(df_1)
print()
print(df_2)

   client_id     product
0     100103   product_2
1      21990   product_2
2     455323   product_1
3     100103   product_1
4      21990   product_1
5     455232   product_3
6    4555323   product_3
7      21990   product_3
8     455323   product_6

      product  price
0   product_1   1000
1   product_2   2000
2   product_3   3000
3   product_4   4000
4   product_5   5000

In [249]:
# how = 'left', 'right', 'inner', 'outer'

df_1.merge(df_2, how='outer')

    client_id     product   price
0     21990.0   product_1     NaN
1         NaN   product_5  5000.0
2    455323.0   product_1  1000.0
3    100103.0   product_1  1000.0
4    100103.0   product_2  2000.0
5     21990.0   product_2  2000.0
6    455232.0   product_3  3000.0
7   4555323.0   product_3  3000.0
8     21990.0   product_3  3000.0
9         NaN   product_4  4000.0
10   455323.0   product_6     NaN

In [250]:
df_1.merge(df_2, how='inner')

   client_id    product  price
0     100103  product_2   2000
1      21990  product_2   2000
2     455323  product_1   1000
3     100103  product_1   1000
4     455232  product_3   3000
5    4555323  product_3   3000
6      21990  product_3   3000

In [251]:
df_new_1 = pd.DataFrame({'client_id': [100103, 21990, 455323, 100103, 21990, 455232, 4555323, 21990, 455323],
                     'product': ['product_2', 'product_2', 'product_1', 'product_1',' product_1', 'product_3', 'product_3', 'product_3', 'product_6'],
                     'color_prod': ['black', 'white', 'white', 'white', 'black', 'black', 'black', 'white', 'black']})

df_new_2 = pd.DataFrame({'product': ['product_1', 'product_2', 'product_3', 'product_4',' product_5', 'product_1', 'product_2', 'product_3', 'product_4',' product_5'],
                         'price': [1000, 2000, 3000, 4000, 5000, 1500, 2500, 3500, 4500, 5500],
                         'color_prod': ['black', 'black', 'black', 'black', 'black', 'white', 'white', 'white', 'white', 'white']})

In [252]:
print(df_new_1)
print()
print(df_new_2)

   client_id     product color_prod
0     100103   product_2      black
1      21990   product_2      white
2     455323   product_1      white
3     100103   product_1      white
4      21990   product_1      black
5     455232   product_3      black
6    4555323   product_3      black
7      21990   product_3      white
8     455323   product_6      black

      product  price color_prod
0   product_1   1000      black
1   product_2   2000      black
2   product_3   3000      black
3   product_4   4000      black
4   product_5   5000      black
5   product_1   1500      white
6   product_2   2500      white
7   product_3   3500      white
8   product_4   4500      white
9   product_5   5500      white

In [253]:
df_new_1.merge(df_new_2, on=['product', 'color_prod'])

   client_id    product color_prod  price
0     100103  product_2      black   2000
1      21990  product_2      white   2500
2     455323  product_1      white   1500
3     100103  product_1      white   1500
4     455232  product_3      black   3000
5    4555323  product_3      black   3000
6      21990  product_3      white   3500

In [254]:
df_new_1.rename(columns={'product': 'prod'}, inplace=True)
df_new_2.rename(columns={'color_prod': 'color'}, inplace=True)

print(df_new_1)
print()
print(df_new_2)

   client_id        prod color_prod
0     100103   product_2      black
1      21990   product_2      white
2     455323   product_1      white
3     100103   product_1      white
4      21990   product_1      black
5     455232   product_3      black
6    4555323   product_3      black
7      21990   product_3      white
8     455323   product_6      black

      product  price  color
0   product_1   1000  black
1   product_2   2000  black
2   product_3   3000  black
3   product_4   4000  black
4   product_5   5000  black
5   product_1   1500  white
6   product_2   2500  white
7   product_3   3500  white
8   product_4   4500  white
9   product_5   5500  white

In [255]:
df_new_1.merge(df_new_2, 
               how='left', 
               left_on=['prod', 'color_prod'],
               right_on=['product', 'color'])

   client_id        prod color_prod    product   price  color
0     100103   product_2      black  product_2  2000.0  black
1      21990   product_2      white  product_2  2500.0  white
2     455323   product_1      white  product_1  1500.0  white
3     100103   product_1      white  product_1  1500.0  white
4      21990   product_1      black        NaN     NaN    NaN
5     455232   product_3      black  product_3  3000.0  black
6    4555323   product_3      black  product_3  3000.0  black
7      21990   product_3      white  product_3  3500.0  white
8     455323   product_6      black        NaN     NaN    NaN

In [256]:
# Аргумент suffixes

df_1 = pd.DataFrame({'product': ['product_1', 'product_2', 'product_3', 'product_4',' product_5'],
                     'count': [10, 20, 30, 40, 50]})

df_2 = pd.DataFrame({'product': ['product_3', 'product_4', 'product_5', 'product_6',' product_7'],
                     'count': [100, 200, 300, 400, 500]})

print(df_1)
print()
print(df_2)

      product  count
0   product_1     10
1   product_2     20
2   product_3     30
3   product_4     40
4   product_5     50

      product  count
0   product_3    100
1   product_4    200
2   product_5    300
3   product_6    400
4   product_7    500

In [257]:
df_1.merge(df_2, how='outer', on='product')

      product  count_x  count_y
0   product_5     50.0      NaN
1   product_7      NaN    500.0
2   product_1     10.0      NaN
3   product_2     20.0      NaN
4   product_3     30.0    100.0
5   product_4     40.0    200.0
6   product_5      NaN    300.0
7   product_6      NaN    400.0

In [258]:
df_1.merge(df_2,
           how='outer', 
           on='product',
           suffixes=['_show_left', '_shop_right'])

      product  count_show_left  count_shop_right
0   product_5             50.0               NaN
1   product_7              NaN             500.0
2   product_1             10.0               NaN
3   product_2             20.0               NaN
4   product_3             30.0             100.0
5   product_4             40.0             200.0
6   product_5              NaN             300.0
7   product_6              NaN             400.0

In [259]:
# Задачи

N_client = 10
N_product = 15

client_1 = {i: f'client_{i}' for i in range(N_client)}
client_2 = {i: f'client_{i}' for i in range(3, N_client+3)}

data_product = {i: f'product_{i}' for i in range(N_product )}
price_1 = {i: (i+1)*1000 for i in range(15)}
price_2 = {i: (i+1)*900 for i in range(15)}

client_list_1 = np.random.randint(0, N_client, 100)
client_list_2 = np.random.randint(3, N_client+3, 100)

product_list = np.random.randint(0, N_product , 100)

shop_1 = pd.DataFrame({'client': client_list_1,
                       'product': product_list,
                       'price': product_list}).replace({'client': client_1, 'product': data_product, 'price': price_1})
shop_2 = pd.DataFrame({'client': client_list_2,
                       'product': product_list,
                       'price': product_list}).replace({'client': client_2, 'product': data_product, 'price': price_2})
product = pd.DataFrame({'product': data_product.values(),
                        'color': np.random.choice(['black', 'red', 'green', 'white', 'blue'], 15),
                        'weight': np.random.randint(10, 20, 15)*10})

In [260]:
display(shop_1.head())
display(shop_2.head())
display(product.head())

     client     product  price
0  client_5   product_9  10000
1  client_9  product_14  15000
2  client_1  product_10  11000
3  client_4   product_3   4000
4  client_0  product_10  11000

     client     product  price
0  client_5   product_9   9000
1  client_9  product_14  13500
2  client_3  product_10   9900
3  client_8   product_3   3600
4  client_9  product_10   9900

     product  color  weight
0  product_0    red     110
1  product_1   blue     170
2  product_2    red     130
3  product_3  green     140
4  product_4   blue     190

In [261]:
shop_1.merge(product, how='left')

      client     product  price  color  weight
0   client_5   product_9  10000    red     150
1   client_9  product_14  15000  white     180
2   client_1  product_10  11000  white     140
3   client_4   product_3   4000  green     140
4   client_0  product_10  11000  white     140
..       ...         ...    ...    ...     ...
95  client_1   product_5   6000  green     130
96  client_6  product_12  13000  green     130
97  client_9   product_0   1000    red     110
98  client_1   product_9  10000    red     150
99  client_5   product_5   6000  green     130

[100 rows x 5 columns]

In [262]:
# Получите DF, в котором каждому купленному товару в первом магазине сопоставлена цена на этот товар из второго магазина. 

new_df = shop_1.merge(shop_2.groupby('product', as_index=False)['price'].mean(), on='product', how='left')
new_df

      client     product  price_x  price_y
0   client_5   product_9    10000   9000.0
1   client_9  product_14    15000  13500.0
2   client_1  product_10    11000   9900.0
3   client_4   product_3     4000   3600.0
4   client_0  product_10    11000   9900.0
..       ...         ...      ...      ...
95  client_1   product_5     6000   5400.0
96  client_6  product_12    13000  11700.0
97  client_9   product_0     1000    900.0
98  client_1   product_9    10000   9000.0
99  client_5   product_5     6000   5400.0

[100 rows x 4 columns]

In [263]:
shop_new_2 = shop_2[['product', 'price']].drop_duplicates()
new_df = shop_1.merge(shop_new_2, on='product', how = 'left').astype({'price_y': np.float64})
new_df

      client     product  price_x  price_y
0   client_5   product_9    10000   9000.0
1   client_9  product_14    15000  13500.0
2   client_1  product_10    11000   9900.0
3   client_4   product_3     4000   3600.0
4   client_0  product_10    11000   9900.0
..       ...         ...      ...      ...
95  client_1   product_5     6000   5400.0
96  client_6  product_12    13000  11700.0
97  client_9   product_0     1000    900.0
98  client_1   product_9    10000   9000.0
99  client_5   product_5     6000   5400.0

[100 rows x 4 columns]

In [264]:
# Получите DF, в котором цене на товар в первом магазине сопоставлена цена из второго. 

df1 = shop_1.groupby('product', as_index=False)[['price']].mean()
df2 = shop_2.groupby('product', as_index=False)[['price']].mean()

new_df = df1.merge(df2,
                   how='left',
                   on='product',
                   suffixes=['_shop_1', '_shop_2'])

new_df

       product  price_shop_1  price_shop_2
0    product_0        1000.0         900.0
1    product_1        2000.0        1800.0
2   product_10       11000.0        9900.0
3   product_11       12000.0       10800.0
4   product_12       13000.0       11700.0
5   product_13       14000.0       12600.0
6   product_14       15000.0       13500.0
7    product_2        3000.0        2700.0
8    product_3        4000.0        3600.0
9    product_4        5000.0        4500.0
10   product_5        6000.0        5400.0
11   product_6        7000.0        6300.0
12   product_7        8000.0        7200.0
13   product_8        9000.0        8100.0
14   product_9       10000.0        9000.0

In [265]:
shop_new_1 = shop_1[['product', 'price']].drop_duplicates()
shop_new_2 = shop_2[['product', 'price']].drop_duplicates()

new_df = shop_new_1.merge(shop_new_2, 
                          on='product', 
                          how = 'left', 
                          suffixes=['_shop_1', '_shop_2']).astype({'price_shop_1': np.float64, 'price_shop_2': np.float64}).sort_values('product', ignore_index=True)
new_df

       product  price_shop_1  price_shop_2
0    product_0        1000.0         900.0
1    product_1        2000.0        1800.0
2   product_10       11000.0        9900.0
3   product_11       12000.0       10800.0
4   product_12       13000.0       11700.0
5   product_13       14000.0       12600.0
6   product_14       15000.0       13500.0
7    product_2        3000.0        2700.0
8    product_3        4000.0        3600.0
9    product_4        5000.0        4500.0
10   product_5        6000.0        5400.0
11   product_6        7000.0        6300.0
12   product_7        8000.0        7200.0
13   product_8        9000.0        8100.0
14   product_9       10000.0        9000.0

In [266]:
# Получите DF, показывающий сколько каждый клиент потратил в первом и втором магазине. Обратите внимание на метки столбцов.

df1 = shop_1.groupby('client', as_index=False)[['price']].sum().rename(columns={'price': 'sum'})
df2 = shop_2.groupby('client', as_index=False)[['price']].sum().rename(columns={'price': 'sum'})

new_df = df1.merge(df2,
                   how='outer',
                   on='client',
                   suffixes=['_shop_1', '_shop_2']).sort_index()

new_df

       client  sum_shop_1  sum_shop_2
0    client_0     87000.0         NaN
1    client_1    100000.0         NaN
2   client_10         NaN     31500.0
3   client_11         NaN     59400.0
4   client_12         NaN     76500.0
5    client_2     72000.0         NaN
6    client_3     38000.0     82800.0
7    client_4     66000.0     49500.0
8    client_5     66000.0    113400.0
9    client_6     96000.0     62100.0
10   client_7     79000.0     63900.0
11   client_8     53000.0     69300.0
12   client_9    123000.0     93600.0

In [267]:
new_df['sort'] = new_df['client'].apply(lambda x: int(x.split('_')[1]))
new_df = new_df.sort_values('sort', ignore_index=True).drop('sort', axis=1)
new_df

       client  sum_shop_1  sum_shop_2
0    client_0     87000.0         NaN
1    client_1    100000.0         NaN
2    client_2     72000.0         NaN
3    client_3     38000.0     82800.0
4    client_4     66000.0     49500.0
5    client_5     66000.0    113400.0
6    client_6     96000.0     62100.0
7    client_7     79000.0     63900.0
8    client_8     53000.0     69300.0
9    client_9    123000.0     93600.0
10  client_10         NaN     31500.0
11  client_11         NaN     59400.0
12  client_12         NaN     76500.0

In [268]:
df1 = shop_1.groupby('client', as_index=False).agg(sum=('price','sum'))
df2 = shop_2.groupby('client', as_index=False).agg(sum=('price','sum'))
new_df = df1.merge(df2, on='client', suffixes=('_shop_1', '_shop_2'), how='outer')
new_df

       client  sum_shop_1  sum_shop_2
0    client_0     87000.0         NaN
1    client_1    100000.0         NaN
2   client_10         NaN     31500.0
3   client_11         NaN     59400.0
4   client_12         NaN     76500.0
5    client_2     72000.0         NaN
6    client_3     38000.0     82800.0
7    client_4     66000.0     49500.0
8    client_5     66000.0    113400.0
9    client_6     96000.0     62100.0
10   client_7     79000.0     63900.0
11   client_8     53000.0     69300.0
12   client_9    123000.0     93600.0

In [269]:
# Клиент "client_1" покупал товары в первом магазине. Сколько бы он сэкономил, если бы купил товары во втором магазине.
# Результат запишите в переменную sale.

df1 = shop_1.loc[shop_1['client'] == 'client_1']
df2 = shop_2[['product', 'price']].groupby('product').mean()
display(df1, df2)

      client     product  price
2   client_1  product_10  11000
5   client_1  product_13  14000
22  client_1  product_10  11000
27  client_1   product_3   4000
38  client_1  product_11  12000
41  client_1   product_5   6000
45  client_1   product_1   2000
52  client_1  product_13  14000
56  client_1   product_1   2000
58  client_1   product_0   1000
65  client_1   product_2   3000
77  client_1   product_3   4000
95  client_1   product_5   6000
98  client_1   product_9  10000

              price
product
product_0     900.0
product_1    1800.0
product_10   9900.0
product_11  10800.0
product_12  11700.0
product_13  12600.0
product_14  13500.0
product_2    2700.0
product_3    3600.0
product_4    4500.0
product_5    5400.0
product_6    6300.0
product_7    7200.0
product_8    8100.0
product_9    9000.0

In [270]:
df_new = df1.merge(df2, on=['product'], how='left')
df_new

      client     product  price_x  price_y
0   client_1  product_10    11000   9900.0
1   client_1  product_13    14000  12600.0
2   client_1  product_10    11000   9900.0
3   client_1   product_3     4000   3600.0
4   client_1  product_11    12000  10800.0
5   client_1   product_5     6000   5400.0
6   client_1   product_1     2000   1800.0
7   client_1  product_13    14000  12600.0
8   client_1   product_1     2000   1800.0
9   client_1   product_0     1000    900.0
10  client_1   product_2     3000   2700.0
11  client_1   product_3     4000   3600.0
12  client_1   product_5     6000   5400.0
13  client_1   product_9    10000   9000.0

In [271]:
sale = (df_new['price_x'] - df_new['price_y']).sum()
sale

10000.0

In [272]:
# Получите список\массив уникальных пользователей, которые заходили в приложение с персонального компьютера('PC').
# Результат запишите в переменную user_list.

user_merge = pd.read_csv('data/user_merge__1_.csv').drop('Unnamed: 0', axis=1)
region = pd.read_csv('data/region__1_.csv').drop('Unnamed: 0', axis=1)
devices = pd.read_csv('data/devices__1_.csv').drop('Unnamed: 0', axis=1)

display(user_merge.head(), region.head(), devices.head())

     user  id_device        date  action  id_region
0  user_0      10002  2023-01-01    True    1000005
1  user_1      10002  2023-01-02   False    1000002
2  user_1      10003  2023-01-03   False    1000002
3  user_2      10003  2023-01-04    True    1000004
4  user_3      10001  2023-01-05    True    1000004

        id           region
0  1000001           Москва
1  1000002  Санкт-Петербург
2  1000003           Самара
3  1000004             Сочи
4  1000005             Омск

      id      device
0  10001          PC
1  10002      laptop
2  10003       phone
3  10004   microwave
4  10005  calculator

In [273]:
user_merge.merge(devices, left_on='id_device', right_on='id').query('device == "PC"')['user'].unique()

array(['user_3', 'user_5', 'user_7', 'user_9', 'user_10', 'user_11',
       'user_13', 'user_14', 'user_15', 'user_16', 'user_17', 'user_18',
       'user_19', 'user_20', 'user_22', 'user_23', 'user_24', 'user_26',
       'user_27', 'user_29'], dtype=object)

In [274]:
# Получите список\массив устройств, с которыx пользователи заходили в приложение.

user_merge.merge(devices, left_on='id_device', right_on='id', how='left')['device'].unique()

array(['laptop', 'phone', 'PC'], dtype=object)

In [275]:
# Получите список\массив пользователей из Санкт-Петербурга, заходивших в приложение через телефон.

user_merge.loc[user_merge['id_device'] == devices.loc[devices['device'] == 'phone', 'id'].values[0]] \
    .loc[user_merge['id_region'] == region.loc[region['region'] == 'Санкт-Петербург', 'id'].values[0]]['user'].unique()

array(['user_1', 'user_4', 'user_7', 'user_12', 'user_13', 'user_22',
       'user_26'], dtype=object)

In [276]:
ser_dev = devices[devices['device'] == 'phone']['id']
ser_reg = region[region['region'] == 'Санкт-Петербург']['id']

user_merge.merge(ser_dev, left_on='id_device', right_on='id').merge(ser_reg, left_on='id_region', right_on='id')['user'].unique()

array(['user_1', 'user_4', 'user_7', 'user_12', 'user_13', 'user_22',
       'user_26'], dtype=object)

In [277]:
# Получите список\массив с уникальными пользователями из Санкт-Петербурга и Москвы, заходивших в приложение с трех устройств - 'PC', 'laptop' и 'phone'.

ser_reg = region[region['region'].isin(['Санкт-Петербург', 'Москва'])]['id']
user_list = user_merge.merge(ser_reg, left_on='id_region', right_on='id').merge(devices, left_on='id_device', right_on='id', how='left')\
    .groupby('user')['device'].unique().to_frame()

user_list.loc[user_list['device'].astype(str) == "['PC' 'laptop' 'phone']"].index.to_list()

['user_13', 'user_19', 'user_22', 'user_7', 'user_9']

In [278]:
new_df = user_merge.merge(devices, how = 'left', left_on = 'id_device', right_on = 'id').merge(region, how = 'left', left_on = 'id_region', right_on = 'id')
user_list = new_df[new_df['region'].isin(['Санкт-Петербург', 'Москва'])].groupby('user')['device'].apply(lambda x: 1 if x.nunique() == 3 else 0)

user_list[user_list == 1].index.to_list()

['user_13', 'user_19', 'user_22', 'user_7', 'user_9']

In [279]:
ser_reg = region[region['region'].isin(['Санкт-Петербург', 'Москва'])]['id']
user_list = user_merge.merge(ser_reg, left_on='id_region', right_on='id').merge(devices, left_on='id_device', right_on='id', how='left') \
    .groupby('user')['device'].unique().apply(lambda x: len(x)==3)

user_list[user_list].index.to_list()

['user_13', 'user_19', 'user_22', 'user_7', 'user_9']

# 2.7 Скользящие окна. Метод rolling().

In [280]:
df_rol = pd.DataFrame({'col_1': range(5),
                        'col_2': range(90, 95)})
df_rol

   col_1  col_2
0      0     90
1      1     91
2      2     92
3      3     93
4      4     94

In [281]:
df_rol.rolling(3) # 3 - ширина окна

Rolling [window=3,center=False,axis=0,method=single]

In [282]:
for window in df_rol.rolling(3):
    print(window, end='\n\n')

   col_1  col_2
0      0     90

   col_1  col_2
0      0     90
1      1     91

   col_1  col_2
0      0     90
1      1     91
2      2     92

   col_1  col_2
1      1     91
2      2     92
3      3     93

   col_1  col_2
2      2     92
3      3     93
4      4     94

In [283]:
df_rol.rolling(3).sum()

   col_1  col_2
0    NaN    NaN
1    NaN    NaN
2    3.0  273.0
3    6.0  276.0
4    9.0  279.0

In [284]:
# Аргумент min_periods=...
# Количество наблюдений в окне, при котором будем возвращаться nan, если ширина меньше указанного в min_periods

print(df_rol.rolling(3).mean())
print()
print(df_rol.rolling(3, min_periods=1).mean())
print()
print(df_rol.rolling(3, min_periods=2).mean())

   col_1  col_2
0    NaN    NaN
1    NaN    NaN
2    1.0   91.0
3    2.0   92.0
4    3.0   93.0

   col_1  col_2
0    0.0   90.0
1    0.5   90.5
2    1.0   91.0
3    2.0   92.0
4    3.0   93.0

   col_1  col_2
0    NaN    NaN
1    0.5   90.5
2    1.0   91.0
3    2.0   92.0
4    3.0   93.0

In [285]:
# Аргумент step=...

print(df_rol.rolling(3).mean())
print()
print(df_rol.rolling(3, step=2).mean()) # - строки взяты через одну

   col_1  col_2
0    NaN    NaN
1    NaN    NaN
2    1.0   91.0
3    2.0   92.0
4    3.0   93.0

   col_1  col_2
0    NaN    NaN
2    1.0   91.0
4    3.0   93.0

In [286]:
# Операции с методом rolling()

df_rol.rolling(3).agg({'col_1': 'sum', 'col_2': 'mean'})

   col_1  col_2
0    NaN    NaN
1    NaN    NaN
2    3.0   91.0
3    6.0   92.0
4    9.0   93.0

In [287]:
df_rol.rolling(2).agg({'col_1': ['sum', 'min', 'max'], 'col_2': 'mean'})

  col_1           col_2
    sum  min  max  mean
0   NaN  NaN  NaN   NaN
1   1.0  0.0  1.0  90.5
2   3.0  1.0  2.0  91.5
3   5.0  2.0  3.0  92.5
4   7.0  3.0  4.0  93.5

In [288]:
# Задача

df = pd.DataFrame({'sales': np.random.randint(0, 50, 100)},
                  index=pd.date_range('2023', periods=100))
df.head()

            sales
2023-01-01     20
2023-01-02     20
2023-01-03     12
2023-01-04     30
2023-01-05     20

In [289]:
df_rol = df.rolling(7, min_periods=1).agg(['sum','mean', 'min','max'])
df_rol.head()

            sales
              sum       mean   min   max
2023-01-01   20.0  20.000000  20.0  20.0
2023-01-02   40.0  20.000000  20.0  20.0
2023-01-03   52.0  17.333333  12.0  20.0
2023-01-04   82.0  20.500000  12.0  30.0
2023-01-05  102.0  20.400000  12.0  30.0

In [290]:
df_rol.reset_index(inplace=True)
df_rol.head()

       index  sales
                sum       mean   min   max
0 2023-01-01   20.0  20.000000  20.0  20.0
1 2023-01-02   40.0  20.000000  20.0  20.0
2 2023-01-03   52.0  17.333333  12.0  20.0
3 2023-01-04   82.0  20.500000  12.0  30.0
4 2023-01-05  102.0  20.400000  12.0  30.0

In [291]:
df_rol['weekday'] = df_rol['index'].dt.dayofweek
df_rol.head()

       index  sales                        weekday
                sum       mean   min   max
0 2023-01-01   20.0  20.000000  20.0  20.0       6
1 2023-01-02   40.0  20.000000  20.0  20.0       0
2 2023-01-03   52.0  17.333333  12.0  20.0       1
3 2023-01-04   82.0  20.500000  12.0  30.0       2
4 2023-01-05  102.0  20.400000  12.0  30.0       3

In [292]:
# Воскресенье и 6 дней до него + статистики за неделю

df_rol.loc[df_rol['weekday'] == 6]

        index  sales                        weekday
                 sum       mean   min   max
0  2023-01-01   20.0  20.000000  20.0  20.0       6
7  2023-01-08  120.0  17.142857   3.0  32.0       6
14 2023-01-15   62.0   8.857143   0.0  29.0       6
21 2023-01-22  130.0  18.571429   1.0  48.0       6
28 2023-01-29  207.0  29.571429   8.0  41.0       6
35 2023-02-05  168.0  24.000000   0.0  49.0       6
42 2023-02-12  199.0  28.428571  12.0  49.0       6
49 2023-02-19  219.0  31.285714   4.0  46.0       6
56 2023-02-26  145.0  20.714286   0.0  37.0       6
63 2023-03-05  194.0  27.714286   3.0  45.0       6
70 2023-03-12  179.0  25.571429   1.0  42.0       6
77 2023-03-19  202.0  28.857143   8.0  48.0       6
84 2023-03-26  204.0  29.142857   3.0  48.0       6
91 2023-04-02  186.0  26.571429   5.0  48.0       6
98 2023-04-09  137.0  19.571429   4.0  46.0       6

In [293]:
# В индексах строк "weekday" дни недели идут по порядку, 0 - Пн, 6 - Вс. Получите среднее значение в каждых выходных (Сб + Вс)

ind = pd.Series([int(j) for j in ([str(i) for i in np.arange(7)] * 3)], name='weekday')

df = pd.DataFrame({'sum': np.random.randint(10, 30, size=(21))}, 
                  index=ind)
df.head(8)

         sum
weekday
0         17
1         24
2         10
3         27
4         21
5         24
6         17
0         26

In [294]:
new_df = df.rolling(window=2).mean()
new_df = new_df.loc[new_df.index == 6]
new_df

          sum
weekday
6        20.5
6        24.0
6        16.5

# 3.1 Тип данных Datetime.

In [295]:
# Изменение типа данных при импорте

pd.read_csv('data/user_visit.csv', parse_dates=['date']).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 729 entries, 0 to 728
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   user    729 non-null    object
 1   date    729 non-null    datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 11.5+ KB

In [296]:
# Изменение типа данных после импорта

df_date = pd.read_csv('data/user_visit.csv')
df_date.astype({'date': 'datetime64[ns]'}).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 729 entries, 0 to 728
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   user    729 non-null    object
 1   date    729 non-null    datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 11.5+ KB

In [297]:
pd.to_datetime('2024-12-04')

Timestamp('2024-12-04 00:00:00')

In [298]:
pd.to_datetime(df_date['date']).head()

0   2023-01-01
1   2023-01-01
2   2023-01-01
3   2023-01-01
4   2023-01-01
Name: date, dtype: datetime64[ns]

In [299]:
# С указанием формата дата

print(pd.to_datetime('2017-02-19', format='%Y-%m-%d'))
print()
print(pd.to_datetime('17-02-19', format='%y-%m-%d'))
print()
print(pd.to_datetime('February/19/17 Monday', format='%B/%d/%y %A'))

2017-02-19 00:00:00

2017-02-19 00:00:00

2017-02-19 00:00:00

In [300]:
df_date = pd.read_csv('data/user_visit.csv')
df_date['date'] = pd.to_datetime(df_date['date'], format='%Y-%m-%d')
df_date

        user       date
0    user_50 2023-01-01
1    user_28 2023-01-01
2    user_27 2023-01-01
3    user_50 2023-01-01
4     user_3 2023-01-01
..       ...        ...
724  user_12 2023-04-10
725  user_10 2023-04-10
726   user_0 2023-04-10
727  user_28 2023-04-10
728  user_26 2023-04-10

[729 rows x 2 columns]

In [301]:
# Атрибуты и методы

print(df_date['date'].dt.day[0])
print(df_date['date'].dt.month[0])
print(df_date['date'].dt.year[0])
print(df_date['date'].dt.day_name()[0])

1
1
2023
Sunday

In [302]:
df_date.loc[15, 'date'].year

2023

In [303]:
# Диапазон дат

pd.date_range('2023-03-10', periods=10)

DatetimeIndex(['2023-03-10', '2023-03-11', '2023-03-12', '2023-03-13',
               '2023-03-14', '2023-03-15', '2023-03-16', '2023-03-17',
               '2023-03-18', '2023-03-19'],
              dtype='datetime64[ns]', freq='D')

In [304]:
pd.date_range('2023-03-10', periods=10, freq='ME')

DatetimeIndex(['2023-03-31', '2023-04-30', '2023-05-31', '2023-06-30',
               '2023-07-31', '2023-08-31', '2023-09-30', '2023-10-31',
               '2023-11-30', '2023-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [305]:
pd.date_range('2023-03-10', '2023-05-30', freq='ME')

DatetimeIndex(['2023-03-31', '2023-04-30'], dtype='datetime64[ns]', freq='ME')

In [306]:
pd.date_range('2023-03-10', '2023-05-31', freq='ME')

DatetimeIndex(['2023-03-31', '2023-04-30', '2023-05-31'], dtype='datetime64[ns]', freq='ME')

In [307]:
df_date['new_date'] = pd.date_range('2023-03-10', '2023-05-31', periods=df_date.shape[0])
df_date

        user       date                      new_date
0    user_50 2023-01-01 2023-03-10 00:00:00.000000000
1    user_28 2023-01-01 2023-03-10 02:42:11.868131868
2    user_27 2023-01-01 2023-03-10 05:24:23.736263736
3    user_50 2023-01-01 2023-03-10 08:06:35.604395604
4     user_3 2023-01-01 2023-03-10 10:48:47.472527472
..       ...        ...                           ...
724  user_12 2023-04-10 2023-05-30 13:11:12.527472528
725  user_10 2023-04-10 2023-05-30 15:53:24.395604396
726   user_0 2023-04-10 2023-05-30 18:35:36.263736264
727  user_28 2023-04-10 2023-05-30 21:17:48.131868133
728  user_26 2023-04-10 2023-05-31 00:00:00.000000000

[729 rows x 3 columns]

In [308]:
df_date.loc[df_date['date'] == pd.to_datetime('07-03-2023', format='%d-%m-%Y')]

        user       date                      new_date
453  user_16 2023-03-07 2023-04-30 00:35:36.263736264
454  user_21 2023-03-07 2023-04-30 03:17:48.131868132
455  user_20 2023-03-07 2023-04-30 06:00:00.000000000
456   user_1 2023-03-07 2023-04-30 08:42:11.868131868
457  user_18 2023-03-07 2023-04-30 11:24:23.736263736
458  user_11 2023-03-07 2023-04-30 14:06:35.604395605
459  user_18 2023-03-07 2023-04-30 16:48:47.472527473
460   user_9 2023-03-07 2023-04-30 19:30:59.340659341

In [309]:
# Задачи

In [310]:
# Поменяйте тип данных в столбце "date" на "datetime" и установите его в качестве индексов строк.

df_date.astype({'date':'datetime64[ns]'}).set_index('date').head()

               user                      new_date
date
2023-01-01  user_50 2023-03-10 00:00:00.000000000
2023-01-01  user_28 2023-03-10 02:42:11.868131868
2023-01-01  user_27 2023-03-10 05:24:23.736263736
2023-01-01  user_50 2023-03-10 08:06:35.604395604
2023-01-01   user_3 2023-03-10 10:48:47.472527472

In [311]:
# Добавьте столбец с годом "year" и столбец с днем недели в виде числа "weekday".

df_date.astype({'date':'datetime64[ns]'})

        user       date                      new_date
0    user_50 2023-01-01 2023-03-10 00:00:00.000000000
1    user_28 2023-01-01 2023-03-10 02:42:11.868131868
2    user_27 2023-01-01 2023-03-10 05:24:23.736263736
3    user_50 2023-01-01 2023-03-10 08:06:35.604395604
4     user_3 2023-01-01 2023-03-10 10:48:47.472527472
..       ...        ...                           ...
724  user_12 2023-04-10 2023-05-30 13:11:12.527472528
725  user_10 2023-04-10 2023-05-30 15:53:24.395604396
726   user_0 2023-04-10 2023-05-30 18:35:36.263736264
727  user_28 2023-04-10 2023-05-30 21:17:48.131868133
728  user_26 2023-04-10 2023-05-31 00:00:00.000000000

[729 rows x 3 columns]

In [312]:
# Получите только те строки, которые в столбце "date" содержат конец месяца.

df_date.loc[df_date['date'].dt.is_month_end].head()

        user       date                      new_date
218   user_4 2023-01-31 2023-04-03 13:19:07.252747253
219   user_9 2023-01-31 2023-04-03 16:01:19.120879121
220  user_25 2023-01-31 2023-04-03 18:43:30.989010989
221   user_5 2023-01-31 2023-04-03 21:25:42.857142857
222  user_17 2023-01-31 2023-04-04 00:07:54.725274725

In [313]:
# Получите данные о доходах в каждом месяце.

data = {
    'date': ['2018-01-01', '2018-01-15', '2018-02-01', '2018-02-15', '2018-03-01', '2018-03-15'],
    'salary': [1000, 1500, 1100, 1300, 1200, 1400]
}
df = pd.DataFrame(data)

df['date'] = pd.to_datetime(df['date'])
df.rename(columns={'date': 'month'}, inplace=True)
df['month'] = df['month'].dt.month
new_df = df.groupby('month', as_index=False).sum()
new_df

   month  salary
0      1    2500
1      2    2400
2      3    2600

In [314]:
# Создайте объект DatetimeIndex, который содержит 20 элементов, начинающихся с "2023-05-05" и частотой в один день.

date_range = pd.date_range('2023-05-05', periods=20)
print(date_range)
len(date_range)

DatetimeIndex(['2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24'],
              dtype='datetime64[ns]', freq='D')

20

In [315]:
# Расчет продуктовой метрики DAU. DAU - количество уникальных пользователей в день.
# В программе созданы файлы с данными - "user_visit.csv".
#             'user' - имена пользователей приложения,
#             'date' - дата когда пользователи заходили в приложение.
# Рассчитайте метрику DAU.

df = pd.read_csv('data/user_visit.csv')
df.head()

      user        date
0  user_50  2023-01-01
1  user_28  2023-01-01
2  user_27  2023-01-01
3  user_50  2023-01-01
4   user_3  2023-01-01

In [316]:
df['date'] = df['date'].astype('datetime64[ns]')
dau = df.groupby('date', as_index=False)['user'].nunique()
dau.rename(columns={'user': 'DAU'}, inplace=True)
dau.head()

        date  DAU
0 2023-01-01    7
1 2023-01-02   10
2 2023-01-03    5
3 2023-01-04    5
4 2023-01-05    8

In [317]:
dau = df.groupby('date', as_index=False).agg(DAU=('user', 'nunique'))
dau.head()

        date  DAU
0 2023-01-01    7
1 2023-01-02   10
2 2023-01-03    5
3 2023-01-04    5
4 2023-01-05    8

In [318]:
# Расчет продуктовой метрики WAU. WAU - количество уникальных пользователей в неделю.
# Рассчитайте метрику WAU.

df['week_num'] = df['date'].astype('datetime64[ns]').dt.isocalendar().week
wau = df.groupby(by='week_num', sort=False).agg(WAU=('user', 'nunique'))
wau.head()

          WAU
week_num
52          7
1          24
2          21
3          26
4          24

In [319]:
# Получите DataFrame в котором есть столбцы 'user', 'date', а также столбец 'flag_reg'. 
# В столбце 'flag_reg' стоит True, если user в этот день зарегистрировался и False, если нет.

user_visit = pd.read_csv('data/user_visit.csv')
date_reg = pd.read_csv('data/date_reg.csv')

display(user_visit.head(), date_reg.head())

      user        date
0  user_50  2023-01-01
1  user_28  2023-01-01
2  user_27  2023-01-01
3  user_50  2023-01-01
4   user_3  2023-01-01

      user    date_reg
0   user_0  2023-01-03
1   user_1  2023-01-08
2  user_10  2023-01-10
3  user_11  2023-01-09
4  user_12  2023-01-10

In [320]:
user_visit['date'] = pd.to_datetime(user_visit['date'])
date_reg['date_reg'] = pd.to_datetime(date_reg['date_reg'])

new_df = user_visit.merge(date_reg, on='user', how='left')
new_df['flag_reg'] = (new_df['date'] == new_df['date_reg']) & (~new_df.duplicated())

del new_df['date_reg']

new_df.head()

      user       date  flag_reg
0  user_50 2023-01-01      True
1  user_28 2023-01-01      True
2  user_27 2023-01-01      True
3  user_50 2023-01-01     False
4   user_3 2023-01-01      True

In [321]:
# Получите DataFrame в котором есть столбцы 'user', 'date', а также столбец 'flag_reg'. 
# В столбце 'flag_reg' стоит True, если user в этот день зарегистрировался и False, если нет.

user_visit = pd.read_csv('data/users_3_1_16.csv', sep=':')
date_reg = pd.read_csv('data/date_reg_3_1_16.csv', sep=';')

display(user_visit.head(), date_reg.head())

      user        date
0   user_2  2023-01-01
1  user_23  2023-01-01
2  user_14  2023-01-01
3   user_3  2023-01-01
4  user_16  2023-01-01

      user    date_reg
0   user_3  2023-01-16
1   user_1  2023-01-18
2  user_20  2023-01-18
3  user_29  2023-01-22
4  user_19  2023-01-23

In [322]:
df = user_visit.merge(date_reg, how='left')
df['flag_reg'] = (df['date'] == df['date_reg']) & ~df.duplicated(['user', 'date', 'date_reg'])
new_df = df[['user', 'date', 'flag_reg']]
new_df.head()

      user        date  flag_reg
0   user_2  2023-01-01     False
1  user_23  2023-01-01     False
2  user_14  2023-01-01     False
3   user_3  2023-01-01     False
4  user_16  2023-01-01     False

In [323]:
# Добавьте столбцы  'holiday_fed', 'holiday_reg', 'weekend' и 'work_day'. Все столбцы должны состоять из значений True или False.
# Столбец 'holiday_fed' - True, если в этот день федеральный праздник, все остальные элементы False.
# Столбец 'holiday_reg' - True, если в этот день региональный праздник, все остальные элементы False.
# Столбец 'weekend' - True, если этот день является субботой или воскресеньем, все остальные элементы False.
# Столбец 'work_day' - True - все дни с понедельника по пятницу, кроме федеральных праздников в эти дни, все остальные элементы False.

calendar = pd.read_csv('data/calendar.csv')
holidays = pd.read_csv('data/holidays.csv')

display(calendar.head(), holidays.head())

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

         date      holiday
0  2023-01-01  holiday_fed
1  2023-01-02  holiday_fed
2  2023-01-03  holiday_fed
3  2023-01-04  holiday_fed
4  2023-01-05  holiday_fed

In [324]:
calendar = pd.read_csv('data/calendar.csv').merge(pd.read_csv('data/holidays.csv'), how='inner').astype({'date': 'datetime64[ns]'})

calendar['holiday_fed'] = calendar['holiday'] == 'holiday_fed'
calendar['holiday_reg'] = calendar['holiday'] == 'holiday_reg'
calendar['weekend'] = calendar['date'].dt.day.isin([5, 6])
calendar['work_day'] = ~(calendar['date'].dt.day.isin([5, 6]) | calendar['holiday_fed'])

calendar

         date      holiday  holiday_fed  holiday_reg  weekend  work_day
0  2023-01-01  holiday_fed         True        False    False     False
1  2023-01-02  holiday_fed         True        False    False     False
2  2023-01-03  holiday_fed         True        False    False     False
3  2023-01-04  holiday_fed         True        False    False     False
4  2023-01-05  holiday_fed         True        False     True     False
5  2023-01-06  holiday_fed         True        False     True     False
6  2023-01-07  holiday_fed         True        False    False     False
7  2023-01-08  holiday_fed         True        False    False     False
8  2023-02-14  holiday_reg        False         True    False      True
9  2023-02-23  holiday_fed         True        False    False     False
10 2023-03-08  holiday_fed         True        False    False     False
11 2023-03-20  holiday_reg        False         True    False      True
12 2023-05-01  holiday_fed         True        False    False     False
13 2023-05-09  holiday_fed         True        False    False     False
14 2023-05-17  holiday_reg        False         True    False      True
15 2023-05-29  holiday_reg        False         True    False      True
16 2023-06-12  holiday_fed         True        False    False     False
17 2023-11-04  holiday_fed         True        False    False     False

In [325]:
# В DataFrame, полученный из файла 'user_visit.csv', добавьте столбец 'num_day', который содержит число дней с момента регистрации, тип данных в столбце - 'int64'.

date_reg = pd.read_csv('data/date_reg__1_.csv')
users_visit = pd.read_csv('data/users_visit__1_.csv')

display(date_reg.head(), users_visit.head())

      user    date_reg
0   user_0  2023-01-08
1   user_1  2023-01-07
2  user_10  2023-01-04
3  user_11  2023-01-07
4  user_12  2023-01-03

      user        date
0  user_50  2023-01-01
1  user_19  2023-01-01
2  user_13  2023-01-01
3  user_50  2023-01-01
4  user_16  2023-01-01

In [326]:
new_df = users_visit.merge(date_reg).astype({'date': 'datetime64[ns]', 'date_reg': 'datetime64[ns]'})
new_df['num_day'] = (new_df['date'] - new_df['date_reg']).dt.days
del new_df['date_reg']
new_df['num_day'] = new_df['num_day'].apply(lambda x: x if x > 0 else 0)
new_df

        user       date  num_day
0    user_50 2023-01-01        0
1    user_19 2023-01-01        0
2    user_13 2023-01-01        0
3    user_50 2023-01-01        0
4    user_16 2023-01-01        0
..       ...        ...      ...
752   user_7 2023-04-10       99
753   user_5 2023-04-10       95
754  user_13 2023-04-10       99
755   user_7 2023-04-10       99
756  user_10 2023-04-10       96

[757 rows x 3 columns]

In [327]:
# В DataFrame, полученный из файла 'user_visit.csv', добавьте столбец 'sev_day', который содержит True, 
# если у соответствующего user-а это седьмой день с момента регистрации, в противном случае False.

date_reg = pd.read_csv('data/date_reg_3.csv')
users_visit = pd.read_csv('data/users_visit_3.csv')

display(date_reg.head(), users_visit.head())

      user    date_reg
0   user_0  2023-01-08
1   user_1  2023-01-07
2  user_10  2023-01-04
3  user_11  2023-01-07
4  user_12  2023-01-03

      user        date
0  user_50  2023-01-01
1  user_19  2023-01-01
2  user_13  2023-01-01
3  user_50  2023-01-01
4  user_16  2023-01-01

In [328]:
new_df = users_visit.merge(date_reg).astype({'date': 'datetime64[ns]', 'date_reg': 'datetime64[ns]'})
new_df['sev_day'] = (new_df['date'] - new_df['date_reg']).dt.days == 7
del new_df['date_reg']
new_df
# new_df['num_day'] = new_df['num_day'].apply(lambda x: x if x > 0 else 0)

        user       date  sev_day
0    user_50 2023-01-01    False
1    user_19 2023-01-01    False
2    user_13 2023-01-01    False
3    user_50 2023-01-01    False
4    user_16 2023-01-01    False
..       ...        ...      ...
752   user_7 2023-04-10    False
753   user_5 2023-04-10    False
754  user_13 2023-04-10    False
755   user_7 2023-04-10    False
756  user_10 2023-04-10    False

[757 rows x 3 columns]

In [329]:
# В DataFrame, полученном из файла "user_visit.csv", user-ов. зарегистрированных в январе, феврале и марте, разбейте на три когорты (группы). 
# Для этого в DataFrame добавьте столбцы 'jan', 'feb' и 'mar'. 
# В этих столбцах должно стоять True, если user был зарегистрирован в соответствующем месяце, в противном случае False.

date_reg = pd.read_csv('data/date_reg_step_6.csv')
users_visit = pd.read_csv('data/user_visit_step_6.csv')

display(date_reg.head(), users_visit.head())

      user    date_reg
0   user_0  2023-01-01
1   user_1  2023-01-01
2  user_10  2023-01-01
3  user_11  2023-01-01
4  user_12  2023-01-01

      user        date
0   user_0  2023-01-01
1   user_1  2023-01-01
2  user_10  2023-01-01
3  user_11  2023-01-01
4  user_12  2023-01-01

In [330]:
new_df = users_visit.merge(date_reg).astype({'date': 'datetime64[ns]', 'date_reg': 'datetime64[ns]'})
new_df['jan'] = new_df['date_reg'].dt.month == 1
new_df['feb'] = new_df['date_reg'].dt.month == 2
new_df['mar'] = new_df['date_reg'].dt.month == 3
del new_df['date_reg']
new_df

            user       date    jan    feb    mar
0         user_0 2023-01-01   True  False  False
1         user_1 2023-01-01   True  False  False
2        user_10 2023-01-01   True  False  False
3        user_11 2023-01-01   True  False  False
4        user_12 2023-01-01   True  False  False
...          ...        ...    ...    ...    ...
15354  user_1807 2023-07-03  False  False  False
15355  user_1808 2023-07-03  False  False  False
15356  user_1808 2023-07-03  False  False  False
15357  user_1816 2023-07-03  False  False  False
15358  user_1820 2023-07-03  False  False  False

[15359 rows x 5 columns]

In [331]:
# Retention - это метрика, которая показывает долю вернувшихся пользователей в день "ХХ" от изначально пришедших.

# Первый вариант: 
# берется нужный временной интервал, например, день, неделя, месяц, год или любой другой. 

# Считается количество пользователей, впервые воспользовавшихся приложением\продуктом в указанный период. 
# Находится сколько пользователей заходили в приложение на следующий день после первого посещения приложения, 
# на второй день, на третий и т.д. Часто рассматривают первые 30 дней с момента первого посещения приложения\продукта.

# Retention = user_in_dayX / all_user

# Второй вариант: 
# в этом варианте рассчитывается удержание пользователей строго в конкретный день после первого посещения. 
# При этом рассчитывается не по всем пользователям приложения, а отдельно для пользователей, впервые посетивших приложение в один день. 
# Чаще всего рассчитывается для первого, седьмого, тридцатого дня после первого посещения приложения и называются Retention первого, седьмого и тридцатого дня соответственно.

# Рассмотрим на примере "Retention седьмого дня". 
# Пусть 2023-01-01 приложение впервые посетили 100 пользователей, через семь дней 2023-01-08 приложение посетили лишь 35 из этих 100. 
# Поэтому "Retention седьмого дня" 2023-01-08 составляет 35%.

# Далее 2023-01-02 приложение впервые посетили 80 пользователей, через семь дней 2023-01-09 приложение посетили лишь 16 из этих 80. 
# Поэтому "Retention седьмого дня" 2023-01-09 составляет 20%. 

# В обоих рассмотренных случаях учитывается только уникальное посещение пользователем. 
# Это значит, что если пользователь зайдет в приложение 10 раз за один день, в Retention это отразится как одно посещение.

In [332]:
# Рассчитайте Retention по всем пользователям с момента регистрации до 30-го дня (включительно). Расчеты представьте в виде DataFrame.

date_reg = pd.read_csv('data/date_reg_step_4.csv').astype({'date_reg': 'datetime64[ns]'})
users_visit = pd.read_csv('data/user_visit_step_4.csv').astype({'date': 'datetime64[ns]'})

display(date_reg.head(), users_visit.head())

      user   date_reg
0   user_0 2023-01-01
1   user_1 2023-01-01
2  user_10 2023-01-01
3  user_11 2023-01-01
4  user_12 2023-01-01

      user       date
0   user_0 2023-01-01
1   user_1 2023-01-01
2  user_10 2023-01-01
3  user_11 2023-01-01
4  user_12 2023-01-01

In [333]:
df = users_visit.merge(date_reg, on='user')
# Рассчитываем количество дней от начальной даты для каждой строки

df['day'] = (df['date'] - df['date_reg']).dt.days

# Создаем список для хранения classic retention на каждый день
ret = []
ind = pd.Series(range(30), name='num_day')
# Рассчитываем classic retention для каждого дня
for day in range(30):        
#     # Выбираем пользователей, вернувшихся в день `day`
    users_with_classic_day = df[(df['day'] == day)]['user'].unique()
    
#     # Рассчитываем classic retention для дня `day`
    ret.append(len(users_with_classic_day) / len(df['user'].unique()))

In [334]:
retention = pd.DataFrame(data=ret, index=ind, columns=['retention'])
retention.head(10)

         retention
num_day
0         1.000000
1         0.463024
2         0.418322
3         0.396247
4         0.360927
5         0.355960
6         0.312914
7         0.289183
8         0.268212
9         0.269316

In [335]:
df1 = pd.read_csv('data/user_visit_step_4.csv', parse_dates=['date'])
df2 = pd.read_csv('data/date_reg_step_4.csv', parse_dates=['date_reg'])

df = df1.merge(df2, on='user', how='left')

df['num_day'] = (df['date'] - df['date_reg']).dt.days

retention = df[df['num_day'] <= 30].groupby('num_day').agg(retention=('user', 'nunique')) / df['user'].nunique()
retention.head(10)

         retention
num_day
0         1.000000
1         0.463024
2         0.418322
3         0.396247
4         0.360927
5         0.355960
6         0.312914
7         0.289183
8         0.268212
9         0.269316

In [336]:
# Рассчитайте Retention седьмого дня. Расчеты представьте в виде DataFrame.

df1 = pd.read_csv('data/user_visit_step_5.csv', parse_dates=['date'])
df2 = pd.read_csv('data/date_reg_step_5.csv', parse_dates=['date_reg'])

display(df1.head(), df2.head())

     user       date
0  user_0 2023-01-01
1  user_1 2023-01-01
2  user_2 2023-01-01
3  user_3 2023-01-01
4  user_4 2023-01-01

     user   date_reg
0  user_0 2023-01-01
1  user_1 2023-01-01
2  user_2 2023-01-01
3  user_3 2023-01-01
4  user_4 2023-01-01

In [337]:
df = df1.merge(df2, on='user', how='left')

# df['num_day'] = (df['date'] - df['date_reg']).dt.days

# retention = df[df['num_day'] <= 30].groupby('num_day').agg(retention=('user', 'nunique')) / df['user'].nunique()

df

            user       date   date_reg
0         user_0 2023-01-01 2023-01-01
1         user_1 2023-01-01 2023-01-01
2         user_2 2023-01-01 2023-01-01
3         user_3 2023-01-01 2023-01-01
4         user_4 2023-01-01 2023-01-01
...          ...        ...        ...
15313  user_1794 2023-07-03 2023-05-30
15314  user_1795 2023-07-03 2023-05-30
15315  user_1800 2023-07-03 2023-05-31
15316  user_1801 2023-07-03 2023-05-31
15317  user_1803 2023-07-03 2023-05-31

[15318 rows x 3 columns]

In [338]:
# Рассчитываем начальные даты для каждого пользователя и объединяем их с исходным DataFrame
df = df1.merge(df2, on='user')

# Рассчитываем количество дней от начальной даты для каждой строки
df['day'] = (df['date'] - df['date_reg']).dt.days

# Создаем список для хранения full retention на каждый день
full_retention = []

for day in range(30):
    # Создаем множество дней, которые мы ожидаем увидеть в полном удержании
    expected_days = set(range(1, day + 1))

    # Получаем уникальные дни активности для каждого пользователя
    unique_days = df.groupby('user')['day'].unique()

    # Определяем пользователей с полным удержанием до retention_day
    full_retention_users = unique_days[unique_days.apply(lambda x: set(x) > expected_days)].index

    # Рассчитываем rolling retention для данного дня
    full_retention.append(len(full_retention_users) / len(df['user'].unique()))

full_retention

[1.0,
 0.43732744340143564,
 0.19160684704583103,
 0.078961899503037,
 0.027056874654886803,
 0.007730535615681944,
 0.0022087244616234127,
 0.0016565433462175593,
 0.0005521811154058532,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0]

In [339]:
# В марте была проведена акция. 
# Рассчитайте retention для пользователей, зарегистрировавшихся в марте, 
# с момента регистрации до 30-го дня (включительно).

df1 = pd.read_csv('data/user_visit_step_7.csv', parse_dates=['date'])
df2 = pd.read_csv('data/date_reg_step_7.csv', parse_dates=['date_reg'])

df = df1.merge(df2, on='user', how='left')

df = df.loc[df['date_reg'].dt.month == 3]

df['day'] = (df['date'] - df['date_reg']).dt.days

retention = df[df['day'] <= 30].groupby('day').agg(reten_user_march=('user', 'nunique')) / df['user'].nunique()
retention.head(10)

     reten_user_march
day
0            1.000000
1            0.461140
2            0.380829
3            0.383420
4            0.380829
5            0.329016
6            0.290155
7            0.300518
8            0.284974
9            0.287565

In [340]:
# Получите список\массив пользователей, которые заходили в приложение до регистрации.

df1 = pd.read_csv('data/user_visit_step_14.csv', parse_dates=['date'])
df2 = pd.read_csv('data/date_reg_step_14.csv', parse_dates=['date_reg'])

df = df1.merge(df2, on='user', how='left')

user_list = df.loc[(df['date'] < df['date_reg']) | (df['date_reg'].isna())]['user'].unique()
len(user_list)

1455

In [360]:
# Если клиент не заходит в приложение 30 дней и более, то он считается "не активным". 
# Его статус поменяется на "активный", если пользователь снова зайдет в приложение.

df1 = pd.read_csv('data/user_visit_step_11.csv', parse_dates=['date'])
df2 = pd.read_csv('data/date_reg_step_11.csv', parse_dates=['date_reg'])

df = df1.merge(df2, on='user', how='left')

In [361]:
def get_days(raw):
    print(raw['date'])
    # return raw['date'] - raw['rate_reg']

In [363]:
df[['date', 'date_reg']].rolling(window=1, step=7).count()

       date  date_reg
0       1.0       1.0
7       1.0       1.0
14      1.0       1.0
21      1.0       1.0
28      1.0       1.0
...     ...       ...
16345   1.0       1.0
16352   1.0       1.0
16359   1.0       1.0
16366   1.0       1.0
16373   1.0       1.0

[2340 rows x 2 columns]